[
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Eye opening", "review_description": "I come from Montreal myself and I was interested to learn a bit of history in my own town. I was surprised to learn so many interesting historics facts about my own town! I definetly recommended it from anyone coming from outside Montreal and even from there it was a very eye opening experience and the guide was so friendly"},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Best walking tour I’ve been on!", "review_description": "Had an AMAZING tour experience with Louise! Honestly one of the best walking tours I have ever had. Louise was very knowledgeable about Montreal and the history and despite random questions always had the answer and an explanation of how or why it came to be! Was a great length time and distance wise and went at a good pace. Told history through stories and the layout of old Montreal which was a super cool and unique way to do it. Overall was a very wonderful experience!"},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "An excellent tour of Old Montreal", "review_description": "My family is visiting Montreal and we took this tour with Martin today, and it was excellent! We learned so much, saw so many beautiful sites, and Martin was very funny and entertaining while sharing so much history and detail. He took care to make sure I was ok (I'm visually impaired and use a cane) and stopped for a bathroom/sitting break midway through.  And he recommended an excellent place for Poutine when we were done! I highly recommend Martin and this tour if you are visiting Montreal!"},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Louise was the best!", "review_description": "Louise made Old Montreal come alive for us!  Her expertise, gracious and kind manner made the learning experience one of a kind.  "},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Wonderful guide, wonderful tour!", "review_description": "Excellent choice! I highly recommend choosing this small group walking tour if you want to see and learn all about Old Montréal. Our guide, Martin, provided the historical information we wanted in an entertaining way. He was the kind of teacher we would have all loved to have. It was a small group (10 adults) and he engaged us all, asking and answering questions and getting to know us in a personable way. He learned where we were from and worked that into the presentation- making connections, etc. At the end of the tour he provided us with a printout of names and addresses of businesses and restaurants that he could vouch  for. This was a wonderful small business to deal with. We would absolutely book with them again."},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Montreal delights", "review_description": "Delightful journey with our guide who was very knowledgable and provided excellent commentary. Enjoyed meeting other walkers too."},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Great walking tour!", "review_description": "Tom gave us a great tour of old Montreal!  He was so knowledgeable and thorough. The tour was interesting and thoroughly enjoyable. I would highly recommend MTL and Tom for a great walking tour of Old Montreal!"},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "Definitely would recommend", "review_description": "Martin was extraordinary.  Knowledgeable, personable and funny throughout. It was a small group of about 10, and he made a point of incorporating everyone's background."},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": "A must do in Montreal", "review_description": "Our guide, Louise was absolutely wonderful! Her personality and enthusiasm coupled with the love of Montreal’s history made it a memorable experience!"},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": null, "review_description": null},
{"attraction_name": "6. Explore Old Montreal Small Group Walking Tour by MTL Detours", "review_title": null, "review_description": "start time of tour"},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Best experience.", "review_description": "Teddy is the MVP natural born tour guide, upbeat and nothing Is a problem. You definitely want to do this tour."},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Friendly, efficient tour of Banff", "review_description": "We had a great time on our tour of Banff. Angel, our guide, provided great service throughout the day.  We traveled as a couple, but the rest of the group was singles. All seemed to enjoy the stops, food, and secenery in the park."},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Amazing tour guide and best service!!", "review_description": "The best tour we had while at Banff! Our tour guide, Teddy, was amazing! He had great humour, very kind and very knowledgeable about little details in the history and the must see spots in the area. On the day we went, it was my partner’s birthday and I had asked Teddy a good restaurant to bring her to for it. Not only did he provide a great option to eat he even went out of his way to go shopping while we ate to give her a gift for her birthday. If that doesn’t show how above and beyond this service goes for its customers I don’t know what does. Overall, amazing experience. I would recommend to anybody and everybody looking to book a tour, you would 100% enjoy the experience!!"},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "A Wonderful Day Out", "review_description": "I had a fabulous day! The weather was perfect and the views were stunning. Our Tour Operator, Teddy,  was fantastic and the day ran very smoothly. Teddy made sure we were informed every step of the way and answered all questions in a friendly way. He has a nice sense of humour and was very accommodating to the needs of his group."},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Amazing Sights and an Amazing Guide!", "review_description": "We had amazing day with our enthusiastic and professional guide, Teddy! As a travel agent, I have the opportunity to take many tours. Today I truly felt I received great value for the reasonable cost. We traveled with our small group in a new, clean van. The company showed concern for our safety by offering crampons to assure we could make our way through an icy path without fear of falling (as we saw others do) Teddy kept us apprised of the best photography locations, places to eat and much more. As our guide, he accomplished the difficult balance of providing important information without droning on as some do. Like some young guests in our group, we would be happy to tour with him again and enjoy another wonderful day!"},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Incredible!", "review_description": "Incredible tour! Such insightful info learned & Teddy (our tour guide) was so nice and personable. Would highly recommend this tour with this touring company. Super professional and worth every penny!"},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Amazing Tour", "review_description": "Tito was an amazing tour guide! He was kind and very knowledgeable about all of the places we visited. We went towards the end of winter and got to experience Banff in the snow. It was amazing! Tito was always available to help us take pictures. The day didn’t seem rushed and we were able to see the highlights of Banff. I would highly recommend booking through Rocky Mountain trips! They are a family business and they are already at the top of our list for summer adventures in Banff!"},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Great tour! Beautiful sights", "review_description": "Had a great time on the tour with Teddy as our guide. Tito was also very responsive to any questions I had. It was well organized and Teddy was very knowledgeable about the area. We had the opportunity to do a couple of hikes on the tour, which I liked. Saw some amazing sights and it was a really fun day. Would definitely recommend for someone wanting to see the highlights of Banff in a short time frame."},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": "Wonderful Day Trip from Calgary to Lake Louise and Banff", "review_description": "The guide Teddy was very helpful and informative. The small group size allowed visiting the sites at our own space and plenty of time of taking pictures."},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": null, "review_description": null},
{"attraction_name": "7. Explore Banff National Park with Our Premium Day Tour", "review_title": null, "review_description": "Can we be picked up at our hotel  Canmore 9 pax visiting this july 2025"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Great falls experience", "review_description": "Great experience !"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Disappointed on cancellation. Beware!", "review_description": "I canceled in advance because this was on the Canadian side of Niagara Falls. I rebooked on the American side and was told no problem and it was more than the 24 hour cancellation time. Still waiting for my refund."},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Don’t miss this!", "review_description": "Brilliant trip!  We saw whales, seals and sea lions and Luke, our guide was friendly, knowledgeable and really good at spotting the wildlife.  The catamaran was amazing and the free hot chocolate was very welcome"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Best tour of Niagara Falls", "review_description": "Great tours and our guide, Heidi, was the best!  I would highly recommend.  You get to see Niagara Falls ‘behind the falls’, from a boat and from above (the tower)"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Awesome guide. Well lkanned", "review_description": "Stephanie was an amazing tour guide. On time and well communicated pick-up, we got to see more than we would have touring by ourselves."},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Nice tour but no boat ride.", "review_description": "The tour guides were fantastic but we felt we were mislead by the pre tour itinerary which clearly stated that a key part of the tour was a boat ride to falls. Given this was not to be the case we consider the saving should be discounted from our charge. This was not the tour guides fault."},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Excellent experience.", "review_description": "The tour was GREAT! Cheryl was very knowledgeable, funny and energetic! Would highly recommend this tour to anyone! A must do!"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Excellent", "review_description": "My wife and I were on our honeymoon and very much enjoyed the informative and thorough tour . our guide Cheryl was excellent and worked very hard to make sure everyone enjoyed the trip"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Amazing!", "review_description": "This is an amazing tour that takes you to the best areas.  No driving needed and your tickets to events are included and inside history information is a plus.  Our guide was courteous and gave us time to explore.  Highly recommend! Thank you Abin! The personable touch of text in arrival and time was a great experience!"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Be careful what you pay for versus what you get. ", "review_description": "Tour guide was great, tour was disappointing due to not getting what was advertised.  Be careful what you pay for and that if it changes, you may not be notified and given a chance to cancel.  "},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": "Niagara Vacation", "review_description": "We had a wonderful time. We were disappointed that the city hasn’t allowed the boat to start but Martine was so thoughtful and entertaining that we didn’t actually miss the boat. Niagara Falls was beautiful and the Skylon tower was breathtaking. Thank you Martine for all your knowledge and information. You really made our tour great!"},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": null, "review_description": null},
{"attraction_name": "3. Best of Niagara Falls Canada Small Group Boat and Behind Falls", "review_title": null, "review_description": "Bonjour, pouvez vous venir nous chercher dans un hôtel a Oakville ? Et est il possible d’avoir un guide en français ? Nous sommes 4. Merci"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Disappointed", "review_description": "Kevin our guide was great!  The low rating was due to the lack of communication from Trip Advisor.  The Niagara Falls boats were not running yet (beautiful sunny 70 day).  Instead of the boat, we went to an observation tower.  I expect to get a large refund from Trip Advisor-the behind the falls and observation tower to not come anywhere close to what we paid.  Trip Advisor failed us."},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Scam! Do not book!!", "review_description": "Do not book with this company! They are a complete scam. They charged my family for a boat tour and behind the falls tour. We got to our hotel and I didn’t see any boats in the water. The day of the tour I called to confirm and was told that there were no boat tours running. I requested a refund and they directed me to another phone number. After lots of back and forth I was refused a refund. Almost $400 for an experience my entire family was looking forward to that literally did not exist.  Do NOT book this experience- they will steal your money!"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Scam Alert - Bait and Switch", "review_description": "BEWARE SCAM ALERT!! Booked this online through Viator which is a third party that works with  local group tours in this case Canada walks. The advertisement only had a picture of a boat and promoted a boat tour - there was no visible print stating boat tours don't begin until May. They should not be allowed to falsely advertise a clear boat tour trip if they don't provide a boat trip as part of it. This is a bait and switch. We drove to the site expecting to get on a boat and they said it's a walking tour - $300 US for a walking tour which my kids can't even do? Are you serious. So we asked for a refund and they said no - and then called Viator and they said nothing they could do. So contacted credit card company and reported as fraudulent and false advertising and they will credit on their end and do an investigation. The two people who said they wouldn't give a refund were rude and actually said \"you should have read the fine print\" they both should be fired. Do not do business with these companies."},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Great Tour Despite Boats Not Operating", "review_description": "Kevin, our tour guide, was exceptional. The welcome from the start and the interaction was excellent. Kevin’s knowledge as a local enhance the experience and despite not being able to go on a boat tour due to the icy conditions, the trip to the Skylon tower was a capable replacement. "},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Loved it", "review_description": "Our tour guide Frank was so helpful and friendly! We didn’t know that the boat tours weren’t running due to the ice however was still very enjoyable"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Fantastic day and highly recommend Viator tours.", "review_description": "On Nov 6, 2024 Viator provided excellent service and information. Very helpful staff answering the phone and arranging our tour. They explained  in detail where we needed to begin our tour and what time. We met at the Maple Leaf Plaza which had ample parking, restaurant and shops. We experienced a maple syrup tasting and chocolate tasting which were included in our tour  What a nice surprise.  Our tour guide was phenomenal - wishing I remember his name.  From start to finish he gave us wonderful tibits of information. We had a fantastic day."},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Incredible experience", "review_description": "Such an incredible experience, we loved going on the boat and getting drenched in the falls! Micko, our tour guide was brilliant and had some incredible facts for us - he also gave us brilliant tips on the best places to eat and best place to stand on the boat!"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": "Great Time at Niagara Falls", "review_description": "Had a great time. Our tour guide was really good. We would recommend this for anyone! The tour was full of history and the boat ride was thrilling! Thank you for the exciting adventure! Happy to do it again!"},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": null, "review_description": null},
{"attraction_name": "5. Niagara Falls Tour with Boat Ride & Journey Behind the Falls", "review_title": null, "review_description": "Are there people for wheel chair assistance? Or do you recommend those that have trouble walking to skip this tour?"},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Great excursion", "review_description": "Awesome day for whale watching, sea lions and seals, with one bald eagle thrown in. Great crew onboard.  Recommend this excursion"},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "100% worth the money. Hands down best tour I’ve ever done.", "review_description": "So awesome! Don’t hesitate to do this tour!! Amazing time. The tour guides were knowledgeable and personable. We were able to see seals, sea lions, transient killer whales, and bald eagle. The scenery was breathtaking!"},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Fabulous view", "review_description": "Super staff,  Roisin was a great guide her enthusiasm was authentic. The ride was smooth but layer up it is chilly. Getting photos done for you allows you to fully enjoy the experience"},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Best and most Knowledgeable whale crew, Awesome experience in Vancouver.", "review_description": "The crew was FANTASTIC!!! We had Captain Carl with the crew being Rosheen (spelling???) Ashley and Wilma with Roman on the camera taking pics for everyone. "},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "You have to try Prince of Whales tours!", "review_description": "Extraordinary. Well beyond our expectations. The crew was knowledgeable, friendly and enthusiastic. Highly recommend."},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Amazin experience watching Whales.", "review_description": "In our 4 hours tours we where able to watch many animals. The experience was amazing and the service also was incredible. Thank you so much to Belen & Victor for the service with the reservation 😊."},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Unbelievable experience", "review_description": "Wow wow wow. What an experience.  Fantastic crew who have clearly built a really special relationship with the whales over the years, so knowledgeable! Amazing pictures. "},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": "Amazing Whale Watching with Prince of Whales!", "review_description": "Our 4-hour tour with Prince of Whales in Vancouver was unforgettable! Despite some rain early on, we saw 8–9 humpback whales, plus bald eagles, sea lions, and stunning coastal views. Roman piloted the boat smoothly, and Ashley, Lucas, Petra, and Karl were knowledgeable, fun, and so passionate about marine life. We also got tons of free digital photos, which was such a great bonus. A true highlight of our trip — highly recommend!"},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": null, "review_description": null},
{"attraction_name": "4. Vancouver Half-Day Whale Watching Adventure with Free Photos", "review_title": null, "review_description": "Is this tour available on January? "},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Destination was beautiful, but…tour guide was an aggressive word bully. If I never see Brent again, it would be too soon", "review_description": "Brent was very aggressive, pushy and spoke to the entire bus of adults as if we were small children. "},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Fabulous fun day in Vancouver", "review_description": "My sister and I had a great tour. Sarah was our guide. We were picked up from our hotel and proceeded to collect others. Sarah was an expert at navigating traffic— congestion, construction and recent directional changes. She arrived at sites while giving thorough commentary, often with witty remarks. She answered questions. She was clear in establishing time limits when stopping and made suggestions for best photo opportunities. She was gracious and professional about different guests’ accessibility requirements (cane or walker). She clearly has a great working relationship with her colleagues as we met other tour groups throughout the day. We loved visiting Vancouver and believe we picked the right all-encompassing tour—Stanley Park, Capilano Suspension Bridge and Overlook, Lions Gate, Granville Island Market, and Vancouver Lookout.  Passed through Chinatown/Gastown/Yaletown with highlights. Saw and heard the Steam Clock. Liked group size (we were 22 total). Marvelous weather. Dropped off at our hotel. Highly recommend and would do it again. It was a great and fun day!"},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Really enjoyed it saw a lot of Vancouver highlights", "review_description": "Tour was great     Capilano Bridge was very busy maybe we should have gone there first to avoid the crowds   Saw a lot of the highlights of Vancouver that were interesting"},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Worth the money", "review_description": null},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "A special city", "review_description": null},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Great tour", "review_description": "This was a great tour - it covered the highlights of Vancouver that I wanted to see. The tour length was just right and the tour guide was very friendly and very knowledgeable. Highly recommend this tour."},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "GO FOR IT", "review_description": "EXCELENT TOUT}R BUT THE BEST WAS OUR GUIDE. AN OVERVIEW VERY HELPFUL. VERY RECOMENDABLE IF YOU HAVE SOME LIMITED TIME IN THE CITY"},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Vancouver City sights tour - on a gorgeous clear, sunny day 😊", "review_description": "A worthwhile trip as it enabled us to see a lot of Vancouver without too much walking. Our driver/guide, Quenten was amazing. He was full of energy and extremely knowledgable. He was very kind to the group we were with and took great care of us. Thank you!"},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "Wonderful tour", "review_description": null},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": "An excellent tour to start a vacation in Vancouver", "review_description": "This is a very good way to start our vacation in Vancouver as it covers most of popular activities or must to do things while in Vancouver.  Our guide, Rodrigo, is fun, entertaining and able to explain things clearly.  His decision to start with Capilano suspension bridge was also a good one, as it allowed us to beat the crowds and enjoying the place more effectively with enough time.  Interesting and useful information as well as enough time to explore other places such as Stanley Park, Granville island, and the Vancouver lookout. "},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": null, "review_description": null},
{"attraction_name": "8. Vancouver City Sightseeing Tour: Capilano Suspension Bridge & Vancouver Lookout", "review_title": null, "review_description": "Do you have a Vancouver tour that will pick up at Cruise Port and drop off at Airport (and carry luggage)."},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Fantastic day out from Toronto", "review_description": "Suresh was so welcoming from the word go. He so wanted everyone to have the best day ever at Niagara Falls, and he didn’t fail! We stopped at the Niagara Clock, the maple leaf shop where we got to taste 3 different maple syrups, and some gorgeous chocolates made on site. Then we saw the Niagara whirlpool. It was such a lovely build up to the main event! Then on to Niagara. We paid for the boat trip, and I gave to say it was one of the most amazing things I have done, the boat goes as close as it can to the water falls, it’s a great experience. Then a couple of hours to spend in Niagara town. "},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Amazing visit with an amazing guide !", "review_description": "The excursion was amazing, our guide was perfect ! He took care of us the entire day and helped with every question we had. He facilitated every step of the way and shared loads of interesting and endearing facts about the hallmarks we passed. He even gave us refreshments and treats all day. The minibus was perfectly clean too! Really perfect from top to bottom. And the Falls ! The Falls were a wonderful experience, a once in a lifetime event. I really recommend going on the boat it's truly a unique feeling of communion with Niagara Falls. I couldn't recommend it more, it was truly amazing especially with a wonderful guide like Paulie!"},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Great Day-Trip!", "review_description": "My wife & I loved this day trip! Pickup right outside our hotel was super convenient, the maple syrup tasting was fun & tasty, and the Falls were beautiful. We did not do the boat option (chilly weather & cold water made us decide to skip it), and still had a blast! Only wish we had more time to check out the power museum & cherry blossom trees at the falls. Traffic back into the city was pretty bad, but that’s out of their control. Otherwise it was a great trip! Tracy was a great guide and very friendly throughout the trip."},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Trip to the falls ", "review_description": "Fantastic trip to the falls with Tracy our guide. Great value with added bonus of a stop off to sample maple syrup and chocolate!!. Trip itself was perfect balance of timings between the falls and seeing the area itself. "},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "A Must Do Trip to the Falls", "review_description": "Fabulous Niagara Falls Day trip from Toronto. We saw everything we wanted to - easy access to all attractions."},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Excellent Day Out!", "review_description": "John our driver was brilliant. "},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Recommended for a great day trip to Niagra.", "review_description": "Kaleb was awesome. Very knowledgeable and personable."},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Fantastic time, John, our tour guide was excellent.", "review_description": "Had an amazing time on the tour, John was a fantastic guide, very knowledgeable and helpful when navigating the experience in Niagara. 10/10 experience"},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": "Highly recommend!", "review_description": "Tracy did an excellent job. She was on time, easy to talk to, pointed things out along the way, communicated times to be back on the bus and made sure everyone got to their desired activities."},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": null, "review_description": null},
{"attraction_name": "2. Niagara Falls Canada Day Tour From Toronto + Boat Cruise Option", "review_title": null, "review_description": "Hi .. am interested in doing your tour from Toronto to Niagara Falls plus the boat.  Can you tell me firstly can i\n do the tour leaving from Toronto but not returning as I want to stay in Niagara and then go on to Buffalo '  Secondly would you allow me to bring a smallish  airline cabin bag on the bus.  "},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Sulphur Mtn Gondola Excursion", "review_description": "Great “E-Ticket” ride to the top of Sulphur Mountain.  Staff were very friendly and helpful.  Views were spectacular from the peak with an additional walking path to the old weather station."},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Great experience at an affordable price.", "review_description": "An absolute must-do if you’re in the Banff area. It’s easy to get to using one of the local Roam shuttle buses. The check-in is well organized, and the line moves quickly. It’s a quick but fun ride to the top. The vistas are spectacular. Bring an extra layer of clothing though. The temps at 8 thousand feet can be brisk!"},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Amazing views from the top of the gondola", "review_description": "We booked tickets in advance via TripAdvisor to avoid disappointment. On arrival, a friendly member of staff directed us to the booth to exchange our voucher. We joined the queue for the gondola. The staff were very efficient, and we did not wait long before we began our experience climbing up Sulphur Mountain. On arrival at the top, we took in the views before climbing to the top floor of the building, which allowed us even greater views of the surrounding mountains and the town of Banff. We spent about an hour relaxing and taking in the vista before descending in the gondola. Again the staff were very friendly and thanked us for our visit. One of the must do things when in Banff."},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Beautiful!", "review_description": "Kinda expensive but I thought it was worth it.  We had a beautiful clear day so the views were amazing!!  We spent about an hour and a half up there enjoying the sights.  Saw a couple of mountain goat grazing.  We really enjoyed it.  We went around 10:00 in the morning.  When we came back down, about 5 or 6 bus loads arrived so I’m glad we got ahead of the rush!!!  Bought our tickets online."},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Bad behaviour of staff on site", "review_description": "The lady checking our tickets was very nasty. We had booked tickets online and checked with her if they were okay and could just join the line, she said yes and after standing in the long line she asked us to exit the line when it was our turn saying we needed printouts of the ticket "},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "No 1 attraction in the area", "review_description": "Definitely a must see if visiting Banff National Park.  Just a bus ride up to the Goldola base then its an 8 minute ride up by gondola and just magical if snowing. There's a cafe, restaurant,  viewing platforms and you can walk up to Sulphur Mountain if you want to. It was snowing so a bit icy to walk."},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Stunning walk and dinner", "review_description": "The walkway and view are breathtaking and dinner in the restaurant at sunset was unforgettable. We spent at least an hour on walkway so get there early enough and try to book seats by window for dinner"},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Nice, but expensive!", "review_description": "Both my friend and I thought the Gondola was “good”, but for the $80 with taxes admission, it was not worth the price. The views were great when we could see, the day we were there was impacted by the weather.  So, for 16 minutes of rides and access to a gift shop, pricey food/coffee and a movie about Banff and a bit of museum, $80.  The free marshmallow and pink lemonade was nice, but $80 nice?  My friend is returning to Banff in June with his father and said that he was taking the gondola off his list for things to do.  If you have better weather, I’m sure you would explore more, but if you are with a family, the price I think would not commensurate with the value you get.  You’ll enjoy yourself, I just wonder how much?"},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Majestueux", "review_description": null},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": "Unbelievable Views", "review_description": "On the day we planned to ride the Gondola to the top of Sulphur Mountain the weather wasn't great. It had snowed a lot the night before and was still snowing. You could hardly see the mountains from town. However, it was our last day in Banff and we didn't want to miss this opportunity. "},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": null, "review_description": null},
{"attraction_name": "1. Banff Gondola Ride Admission", "review_title": null, "review_description": "Tickets say 7 Pm. We want to go at 5:30. Can we reschedule when we get there?  Or, how do we change this time?"},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "A core memory", "review_description": "We absolutely loved this experience! Roger created a wonderful experience for everyone, his incredible storytelling skills created an enjoyable atmosphere, it felt like we had time travelled. Roger was very welcoming and accommodating, thank you once again for a wonderful experience Roger!!"},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Best Tour Operator - Syed", "review_description": "Tour operator Syed was tooo good. He made our day and was the highlight of our USA trip. Very inclusive, welcoming, comfortable and fun trip thanks to the operator."},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Great way to see Niagra Falls!", "review_description": "A great way to spend Mother's Day! The experience was great - Maid of the Mist, Cave Tour, Goat Island (we had a little extra time, so we went and saw Whirlpool Park as well). Our driver was prompt and informative. He took care of getting our tickets and directing us where to go. The views were amazing!"},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Wet and Wild Niagara Adventure", "review_description": "The views were amazing and we took so many photos and OK even though the weather wasn’t cooperating it’s still a core memory for me and my family."},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "A good experience", "review_description": "We enjoyed the tour. It is beneficial for those like us who were new to the area. Saves a lot of trying to decide what should be seen. Our host was friendly and accommodating and took the time to always answer questions. Great, too, to be  picked up and dropped off at the hotel."},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Amazing", "review_description": "Highly recommend this, had an amazing time and great views along the whole tour. Just be sure to wear pants and shoes you don’t mind getting wet. You will have a blast"},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Excellent. Highly recommended", "review_description": null},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "An Unforgettable Tour Experience!", "review_description": "Our tour guide, Saied, was absolutely fantastic! He was incredibly friendly and knowledgeable, making our experience truly memorable. Saied arrived promptly at our hotel to pick us up, which set a great tone for the day."},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "Excellent tour", "review_description": null},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "DO NOT BOOK WITH THESE FALSE ADVERTISERS", "review_description": "I would give 0 star if I could. Booked this excursion prior to arriving at Niagara Falls. When we got there and saw the water still frozen I inquired how we could do the boat ride. The excursion operator stated no boat ride, but we would get tacos and watch bats from the shoreline. What a joke…they will still let you book a boat ride even when there cannot be a boat ride, then offer you tacos & bat viewing. That is false advertising but Viator was able to cancel our reservation and give us a refund. We are not paying $219 for the two of us to eat tacos & watch bats at Niagara Falls."},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": "NO BOAT ride !! Ice ice ice", "review_description": "Please Check  the ice situation before booking bc the company will not tell you !! Since the ice cane in 5 days ago you CANNOT go on the boat !! They escort you around in a van !! Mark our tour guide did a nice job but apparently this ice has been here for about a week & the company did not notify anyone! Terrible business"},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Our driver was awesome.", "review_description": "I gave 4 stars because of Roger and the person I spoke at the phone. Otherwise I’m only gonna give 3 stars. We booked our trip last minute and the company wasn’t able to communicate with the driver that we are included at the trip. After a couple of phone calls, we waited total of 30mins to be picked up. And also we didn’t know that Morraine lake is closed until end of May. (I guess it’s our fault too not to research in advance). It didn’t say on their website that it was closed. If you will go to their website it will say Morraine lake and Lake Louise tour and that’s what we booked. If we only knew we didn’t have to do this tour which cost us $300+ for our group. We can drive to lake Louise ourselves. We only booked this tour because of Morraine lake since you can’t go to Morraine lake with a private vehicle. $300+ is not worth it just for an hour stop at lake Louise and a short hike to Marble canyon. "},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Fantastic day and worth every cent", "review_description": "Our guide Roger Roger was fantastic from collection in Calgary to drop off at the end of a fabulous day. His trainee Ted was also helpful. The views from our transport vehicle were great. The information and music provided were appreciated. We even had 4 rainbows, snow at Lake Louise and a variety of wildlife spotted during the course of the day."},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Brilliant one day experience", "review_description": "Brilliant taster of multiple different spots in one day. Marble canyon was a real highlight. Our guide Matt was friendly and interesting but there was plenty of time to go off and do your own thing at each site too. I’d highly recommend this tour to anyone who has just one day to explore the national park from Calgary"},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "A WOW taster of Banff", "review_description": "Chose this by luck out of the various tours. Phil was engaging and never annoying as a guide with interesting information and an approachable manner. He made sure all of the party made their way up the muddy and slippery path at Marble Canyon. "},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Excelent tour!", "review_description": "Thanks to our guide Deniz, it was an amazing tour! Beautiful places and photos, and very interesting information provided by Deniz. We highly recommend it!"},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Phenomenal Day of Sightseeing…", "review_description": "Overall tour was great! Our Tour Guide Roger Roger was very knowledgeable and passionate about his job.  He shared a lot of interesting facts throughout our journey which is always welcomed when on a tour. One of the most interactive tour guides I’ve seen."},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Canadian Rockies - amazing trip!!!", "review_description": "We loved our tour of the Canadian Rockies. Stephen was amazing tour guide and we had a great time. We highly recommend this tour if you visit Calgary."},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": "Incredible stops and fun guide", "review_description": "Steve’s a fun tour guide and the stops were all incredible. I assumed I’d get bored during the drives but I absolutely wasn’t"},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": null, "review_description": null},
{"attraction_name": "12. Lake Louise, Moraine Lake, Banff Tour from Calgary/Canmore/Banff", "review_title": null, "review_description": "Hi. We are traveling here next week (10/20-26th). Is this tour to Lake Louise and Lake Moraine with a stop in Jackson Canyon available next week? Or is Lake Moraine closed to the tours as well after 10/15? Any help is greatly appreciated "},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": null, "review_description": null},
{"attraction_name": "9. Best of Niagara Falls USA + Cave of the Winds + Maid of the Mist", "review_title": null, "review_description": "I will be in Buffalo---at Courtyard Marriott .\nIs there any way this tour can accomodate someone from buffalo???"},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Great tour of the must see things in Niagra Falls", "review_description": "The tour was great!  Dayna was a great driver and guide.  She was so helpful and was kind enough to take pur pictures with our phones instead of us getting pressured into paying to be photographed.  Dayna had good, not boring, information to share.  She projected her voice well when we were outside and on the bus speaker worked good when we were in the bus.  The tour is good for all ages and most abilities.  I am not sure how people with wheelchairs and walkers would fare as there is a bit of walking everywhere we went.  There were probably accessible areas and accommodations, but I didn't notice any.  I think Dayna made everyone feel comfortable and it was more like we were on a roadtrip with a friend than with a guide.  The views of all of the falls were amazing.  There were plenty of restrooms/washrooms.  We were allowed to bring a bag.  I would recommend you bring a towel, just in case...also water and snacks.  I think we could have skipped the lunch break as the food court was kind of pricey.  I was able to get poutin which was good, and I am glad I tried it.  The Maid of the Mist was the best part and we did that first.  The Skylon was alos neat and even though there was a bit of an elevator malfunction, Dayna stayed calm, and kept us calm and at ease.  Dayna gave us ideas of other things to do during our stay, and she drove us through the tourist street which was nice to get a preview of what was there.  The falls and all of the attractions were breathtaking, \"Ehmazing\", and fun.  If you get to specify when making your reservation, I would highly recommend you ask for Dayna with a Y.  She was professional and personable."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Wonderful Day! Ask For Dayna", "review_description": "Dayna was absolutely amazing! Fun, personable, engaging, and just a joy to have as our tour guide. Over The Falls is lucky to have such a wonderful person."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "experience and  explore Niagara Falls with \"Indiana Jones\"and over the Falls tours", "review_description": "over the fall tour guide Jessica put the awe in awesome the inform in informative and the wonder in wonderful she went overboard to make sure we got the best pictures and had the most amazing time to see Niagara Falls deep down sky high and in between Jessica is truly a professional that gives the best service to her guest \"Indiana Jones\" ready for the next amazing adventure with 'over the Falls tours\"."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Well worth the money", "review_description": "Our tour guide Nancy was awesome.  My dad is having some mobility issues, and she was terrific in helping him out.  The tour was great, we got to see both sides of the falls in one day.  Over the falls tours is excellent, they keep you up to date between emails, calls and texts.  They picked us up right from our accommodation and dropped us off at thw rnd if thw day.  I really enjoyed my tour and look foward to coming back some day for another."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Fantastic day, thanks to Nancy!", "review_description": "Great day thanks to Nancy! She is amazing: energetic, knowledgeable, kind, hepful and very well organized! Our flight coming into Buffalo was 3 hours late, but thanks to her we managed to cover everything we planned! I highly recommend her and Over the Falls Tours!"},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Great introduction to Niagara Falls", "review_description": "This tour was a great introduction to Niagara Falls.  It took us to most of the major attractions without the hassle of finding our way around a new city and parking. Our guide , Dayna, was amazing; she covered all of the details we might have missed out on as first time tourists. She went out of her way to be sure everyone knew how to get to the attractions not covered on this trip and to give us pointers about getting around the city.  She is an outstanding guide and provided us with an enjoyable tour."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Perfect Niagara Falls in a day!", "review_description": "Great Tour with Jessica! She is the best! Very organised, very informative and insightful! And a great driver! Love her energy! "},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "An amazing day of information and adventure! With a splash of thundering waterfalls!", "review_description": "Jessica was an amazing tour guide! My friend had gone about a month ago and told me we just had to go on this tour when I came to town!! She was so informative and energetic! I would definitely take another tour with her!! 5+ stars!!"},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": "Best part of the vacay", "review_description": "Jessica was awesome! Her communication, responsiveness, and knowledge was top notch. Literally not one negative comment to make regarding her or the tour."},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": null, "review_description": null},
{"attraction_name": "13. Niagara Falls in 1 Day: Tour of American and Canadian Sides", "review_title": null, "review_description": "Are there bathrooms available on board?"},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Best ever road trip - it’s true", "review_description": "Hello Colin, Cheyenne and Logan,"},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Discovering Quebec city", "review_description": "Our walking tour guide Louise wasn't born in QC but has chosen this city and loves it so much. She is a well of knowledge and can talk about the history and modern days of QC for hours. She also gave us her list of things to do in QC on our own which was very useful."},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Rock the Rockies", "review_description": "The glacier is easily accessible by the ice explorer and it is fantastic! Besides, our skywalk guide Liz is very professional and enthusiastic! "},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Great experience!", "review_description": "Had a great time on the Glacier with Jake our guide and driver.  The vehicles are amazing and Jake made it fun.  It was blustery and cold but the glacier was beautiful."},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "A wonderful tour for us from Minnesota.", "review_description": "It was an incredible experience!  We learned so much from Harry & Jackson!  We loved their humor!  We loved the  knowledge of our guides.  We felt very safe & comfortable!"},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Excellent tour with great guides", "review_description": "We started on a tour bus with driver Pat and guide Tom. They were both very knowledgeable about the area and imparted some memorable facts. We then transferred to the bus to go onto the glazier. This was driven by Jake, who again was very knowledgeable, and he encouraged us to ask questions. The whole tour was so memorable, and one ticked off the bucket list."},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Walking on the GLACIER and SKYWALK!!!", "review_description": "Wonderful experience, both places!!!  You will not regret going!!!  Enjoy!!!!  Pretty cool ride going on that glacier!!!!  Buckle up and hang on!!!!"},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Fantastic trip to cross off the bucket list! So glad we did this, was awesome!", "review_description": "My husband and I had a fantastic time. We found"},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Columbia Icefields & Athabasca Glacier with Skywalk", "review_description": "A unique excursion, well organised with a stunning backdrop providing awesome views. All the staff were very knowledgeable. This trip is not to be missed! Special mention to Jackson, from Blackpool, UK, who was our 6 wheel driver onto the glacier. He gave us an  informative but fun experience with his warm friendly chatter. Definitely  a Canadian highlight for my husband  & myself!"},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": "Great experience!", "review_description": "Great tour with Jackson! He was informative, friendly, and funny — kept us engaged and made the Columbia Icefield experience truly special."},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": null, "review_description": null},
{"attraction_name": "10. Columbia Icefield Tour with Glacier Skywalk", "review_title": null, "review_description": "Is it better to visit columbia ice fields i’m morning or afternoon tours?"},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Very enjoyable tour indeed!", "review_description": "Paul was a great guide. The two hours tour went so fast, even though it was a rainy day. We enjoyed listening to our guide's stories and the itinerary was great."},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Outstanding", "review_description": "Our guide Phil made this tour. He was outstanding and passionate about sharing his city with us. Thank you Phil!"},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Louise was great", "review_description": "Louise was an amazing guide.  Her knowledge and presentation were fabulous. We went to the wrong meeting place and she graciously came to meet us there.  She took extra time with us to make sure we saw everything.  One of the best tours I have ever had.  Ask for Louise."},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Old Quebec walking tour", "review_description": "Our guide (Francis) was extremely knowledgeable and personable, making the tour a great experience. He took us from just outside our hotel through the walls of the fortress and into old town."},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Amazing and informative tour", "review_description": null},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Disappointment", "review_description": null},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Great way to learn about Quebec", "review_description": "Great small group tour highlighting the history of Quebec while walking around this amazing city. Guide was informative and engaging.  Highly recommend!"},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "Great Overview of Old Town Quebec", "review_description": "Scheduled this tour at the beginning of a 3 day trip to Quebec City in order to get an introduction to the city before exploring ourselves. The tour provided a good overview of the history and sites of the old town. It proceeds from the upper town to the lower town making walking easy. The tour guide, Francis, was knowledgeable and engaging. I'd recommend this tour if you've never visited Quebec City before and have limited time to spend there."},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": "We loved our walking tour!", "review_description": "We absolutely loved our walking tour of the iconic UNESCO World Heritage site that is Quebec City! From start to finish, it was an unforgettable experience. Our guide, Mark, was a total gem—hilarious, incredibly knowledgeable, and clearly passionate about the city. We really lucked out having him lead our group."},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "11. Quebec City Walking Tour", "review_title": null, "review_description": "About how far is the distance covered on this tour?\n"},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Ask for Bobby and get a great trip", "review_description": "Bobby is a great tour guide and easy to be around all day.  He talks in a  clear, precise way and willing to discuss all topics until content."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Beautiful Vancouver Island", "review_description": "Great day out. Bobby our tour guide was fantastic. Professional and friendly service, lots of local knowledge.The gardens and Victoria are beautiful."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Jack (The Step) Victorious’Victoria Tour!", "review_description": "Been on tour in Canada for the last two weeks and Jack was the most informative, funny and generally nice guy who we enjoyed immensely! The tour was a little long and a bit tiring but it was still a great day to see Victoria and those beautiful Bucharest Gardens! We also visited the BC Museum. Very nicely presented and well kept, unfortunately you have to pay extra to see the iMax theatre."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Great full day tour", "review_description": "Excellent tour with a  knowledgeable and friendly driver(Bobby). He kept us entertained while driving and gave us explicit directions and offered suggestions on what to see and do."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Family trip to Victoria", "review_description": "I enjoyed the Butchart garden! The tulip was fully bloomed and it was beautiful. It was a 12-hour-long day trip and had lots of moving, but Bobby drove safely and his talk was fun to listen to!"},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Loved the Gardens!!", "review_description": "Great day but a long day! Left at 8:50 and home at 10 pm. The bus and driver were great. Loved the ferry and the gardens. Victoria was just OK. Would have loved more time at the garden. Beware this company was purchased and may not be doing these tours for very long. Driver was honest about the future!"},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Travelling with Jack to Victoria and & Butchart Gardens", "review_description": "The trip was amazing, the Butchart Gardens being the highlight. The fantastic colours of the many varieties of plants was out of this world. Jack, our driver and guide was extremely knowledgeable of Victoria and the gardens and went out of his way to make our trip memorable. His kindness was amazing to the extent that even though we were in an Airbnb and not a hotel, he dropped us off at the door on his way back to the bus depot. This was very much appreciated as it was a long day and we didn’t get home until about 10pm. Thank you so much Jack! The trip was well worth the cost."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Travelling with Jack to Butchart Gardens", "review_description": "Jack was our driver and guide for the day. He entertained us all day with stories and commentaries about Vancouver, the ferry, Butchart Gardens, Vancouver Island, Victoria. It was an amazing tour and the gardens need to be visited and explored to truly see their beauty. We especially appreciated being dropped off at our front door after the tour was over as it was a very long day but worth every minute!"},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": "Butchart Garden", "review_description": "Our tour guide Jason S was amazing. He had the best friendly attitude and abundance of knowledge about this beautiful city.. His compassion towards his tour group was amazing to see .. the Tour was wonderful .The Butchart Garden was heavenly and I could not stop taking pictures.. The tour company was very professional yet easy to work with .."},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": null, "review_description": null},
{"attraction_name": "14. Victoria and Butchart Gardens Tour from Vancouver", "review_title": null, "review_description": "What is the rate for 1 adult visiting Butchart Gardens in June 2025 in US Dollars? In Canadian dollars?"},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "amazing", "review_description": "we did this on our second day at niagra. it was a bit foggy but still really good fun."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Kids loved it!", "review_description": "My kids went alone and the attendants in the booth were amazing. I was able to switch the date due to bad weather. They were very personable and friendly with my kids who were nervous. The two guys on the platform literally strapped in the kids, gave them zero instructions and opened the gate and sent them on their way. My daughter wasn’t even decided that she wanted to do it. They were happy they did it and lived their experience but the guys on the deck could have been more personable."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Never too old", "review_description": "Great fun and a once in a lifetime experience. We’re in our late 50’s/early 60’s and thoroughly enjoyed the experience."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Cool excursion", "review_description": "It was great they took pictures and video for a small fee  the thrill and the excitement of it was also perfect. I definitely wouldn’t mind doing this again. Great experience."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Great!", "review_description": "Amazing experience and great way to see the falls! Paid for the media package which was worth it. Only thing is there was an additional charge to buy the second photo which seems strange if you pay for a package. Apart from that it was great, friendly staff and well worth the visit!"},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Very nice experience", "review_description": null},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Great Zip Line!", "review_description": "Check in location was easy to find and the process was quick and easy. All the staff I came in contact with were very nice and helpful. It was pretty foggy the morning I went, but the view was still beautiful and the zipline experience itself was very fun! All of the equipment appeared to be in great condition and I felt very safe. The pictures and videos available of your adventure afterwards came out great! Would definitely recommend this experience when visiting Niagara Falls!"},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Not cheap, but a definite bucket-list experience for all ages", "review_description": "I did the zipline with my wife, brother and 66-year old mother just before Easter. This was a must-do for us during our time in Niagara Falls, after having seen it on 'Wonders of the World I Can't See' with Chris McCausland."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "First time zip lining.", "review_description": "Great experience with my niece and grandniece!  Had a wonderful view of the falls.   We did not have to wait long in line for the ride."},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": "Great location but poor operation", "review_description": "View is spectacular and it was easy to book plus the staff were friendly. Queuing system was very poor as they could have been much faster and not helped by staff letting friends jump the queue"},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": null, "review_description": null},
{"attraction_name": "16. Zipline To The Falls in Niagara Falls, Canada", "review_title": null, "review_description": "Can I wear my glasses?"},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Amazing", "review_description": "The fly over experience was amazing. Great fun for all ages. Staff was friendly and very helpful. Do note there is a height requirement."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Fun but a little overpriced", "review_description": "Fun experience but a bit overpriced. Allow 40 minutes start to finish. Two options , pick fly over Canada vs Rocky Mountains"},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "What a ride !", "review_description": "We had a super time. What a ride. It was a great experience. We loved it."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Do the activity or dont, it’s not worth the hype.", "review_description": "There seem to be a lot of hype about this attraction, which it sadly does not live up to. For a start its no where near 2 hours its 30 mins max, which includes safety video. Once we started our journey, i did get excited, however that soon dissipated, and i was left wondering, when it was going to get good. The cinematic view was patchy and you could see where the panels were which the film was projected on. You could also see the edge of the screen and then the black roof with equipment. Looking down at my feet i could also see the edge of the screen. This really spoilt the illusion and was hard to feel the magic of what it was set out to achieve. The film felt blurry in places and i wondered if they should re shoot it, and make the colours more vibrant. The example i have is like buying a tv with led and 4 k and really wishing you had bought a OLED 8k one. I have seen much better films at a superior quality at the IMAX. I think it would be great if it was also 3D, at least this would have given the thrills of what i believe they wanted to achieve, i dunno if i would recommend it or not, i suppose if its raining, its an in door thing to do. But i do have to say the only saving grace was that the staff were fantastic, super friendly and answered lots of my pre questions. They were smiley, happy people."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Overpriced under delivers", "review_description": "Not impressed for the price. You pay by the half hour just to park.  You watch a short video before entering which in our opinion was silly and a waste of time. The flyover video is maybe 15 minutes long...  AI generated.   However the misty air, breeze and smells were pretty cool. I would not recommend wasting your time or money here."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Save your money.", "review_description": "As noted in other reviews this is largely a waste of money. The real Flyover experience lasts only 8 minutes and the rest is filler. This ride should be $15 maximum."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Superb flying over Canada simulator", "review_description": "Flyover Canada Experience is exciting and a very good simulation flying over interesting things that what Canada offers… really superb and entertaining, highly recommended."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Flyover!", "review_description": "Fantastic experience, so thrilling! It was fantastic to see all over Canada and it was so exciting. the staff were really friendly"},
{"attraction_name": "15. Flyover in Vancouver", "review_title": "Incredible!", "review_description": "What an awesome experience! They need to do a better job advertising. I went because a freind was visiting and wanted to go."},
{"attraction_name": "15. Flyover in Vancouver", "review_title": null, "review_description": null},
{"attraction_name": "15. Flyover in Vancouver", "review_title": null, "review_description": "Hi. Would people who doesn't undestand English be able to enjoy this activity?"},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Auschwitz Exhibit", "review_description": "The exhibit was just OK. We expected to see more artifacts from Auschwitz instead of just a small handful. There were wall posters throughout to read but bad lighting made it difficult to read, and bad air circulation tired us out. The video commentaries were similar to what one would see on TV. It was disappointing."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "A bit average", "review_description": "A little disappointing for us. Not the biggest museum and a little too much dedicated to furniture to pottery  but I guess it depends on what interest you. It’s around £15 per person but that doesn’t include any other exhibitions that are running which was a shame as we didn’t realize at the time so we missed out on the Auschwitz and Nature in brilliant colour  exhibitions.  If you only have time for 1 museum I would opt for Casa Loma which was amazing."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "ROM is well worth a visit ( or two)", "review_description": "This is a wonderful museum and the variety of exhibits will have at least one thing for everyone. The special exhibit Nature in Brilliant Color was good!  Really enjoyed the birds ,fossils, gemstones, dinosaurs, the Bat cave and the diversity of life exhibits.  Would go again!"},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Great", "review_description": "It was amazing. It was so much fun and it was worth the price. I loved the exhibitions and will use TripAdvisor in the future."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Reminiscing about the ROM", "review_description": "I’ve been to the ROM many times, and each time I go I see the exhibits in a new light. Their special exhibitions are a must see as well. I love their little coffee spot down stairs. The location is in a cool part of town. This is a great place to go whether you just want to hang out by yourself in a place that sparks creativity, or on a date, or just a place to go with friends. Super cool."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "More like a disorderly assemblage of objects.", "review_description": null},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Don’t Miss  the ROM!", "review_description": "We are always profoundly impressed when we go to the ROM, both for their permanent exhibitions and their temporary ones. We just went to see Nature in  Colour and Auschwitz, and in both cases they were remarkable exhibits."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Good museum visit ", "review_description": "Near Subway station. Near Major traffic intersection.  The best time to visit is around lunchtime because lots of areas to gallery  excellent food choices within a five to ten minute walk"},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Third Tuesday of the month - Free entry in the evening!", "review_description": "Third Tuesday of the month - Free entry in the evening!"},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": "Huge and under construction", "review_description": "The museum is huge. I wish we had studied the map ahead of time and planned our course. Current renovations are noisy and made finding the mummies a bit tricky. The Auschewitz exhibit is an extra cost and is 60’+ minutes. It’s an audio tour and not for children.  Worth a separate trip to the museum for it instead of trying to squeeze it in with the rest of the museum. The construction toom away from the overall experience but still worthwhile."},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": null, "review_description": null},
{"attraction_name": "17. Royal Ontario Museum Admission", "review_title": null, "review_description": "Hi, I am currently attempting to purchase tickets for the museum. The original website for the museum states youth age range is 15 to 19 years old but if i wish to purchase through Trip Advisor a youth comes up as 15 to 25 years old. Does this mean some age 21 could go as a youth or must they be purchased as an adult for entry. \nThank you"},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Quebec, a great walkable city", "review_description": "The walking tour was very informative. Unfortunately, the weather did not cooperate, and it was very cold and windy."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Fantastic Glimpse into Old City Quebec", "review_description": "What a great beginning for our Old City Quebec vacation.  Our tour guide Jo was wonderful.  The pace was great to see the important sites of Quebec City and learn the history of the area.  Our goal was to find the most important places to see, and Jo managed this perfectly.  We highly reccommend Old Quebec City Walking Tour with Funicular Ticket.  Fun experience and a very reasonable cost."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Fantastic tour. Choose this one!", "review_description": "We like to support local small businesses and were so happy we found this one. The process from buying the tickets online (through Trip Advisor/ Viatours) to locating the starting location was seamless. Communication was excellent and the operators were well organized. M. Yves Trudeau was an outstanding guide! He was so knowledgeable about the history of his city and you could just tell how much he loved sharing it with others. We were able to see many places both inside and out during the 2 hour tour. We highly recommend this small group walking tour (only 10 people)."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Fun Québec City Walking Tour", "review_description": "Luis was a wonderful and entertaining tour guide. We enjoyed learning about the history of the area, and seeing places we wouldn’t have found on our own. We had a great time with our group and would highly recommend his tour to anyone visiting."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Great Overview for First Time Visitors", "review_description": "Small group setting. Excellent guide who gave us tons of information and history. Perfect overview of Upper  and Lower Quebec."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "I recommend", "review_description": null},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Unmissable!", "review_description": null},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Unmissable!", "review_description": null},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "A  memorable experience in the old City...", "review_description": "Fabulous tour! Marie was a gem-informative and kind. We learned so much in the two hour walking tour of this beautiful historic city."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": "Absolute must-do", "review_description": "This tour is a must. It gives all the interesting history of Quebec, including the cultural and religious historical background. The best tour guide is Jocelyn, who was so knowledgeable and passionate that it made it even more enjoyable. Absolutely recommend this tour on the first day of your visit to acclimate yourself to the city."},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": null, "review_description": null},
{"attraction_name": "19. Old Quebec City Walking Tour with Funicular Ticket", "review_title": null, "review_description": "Does the tour take you inside the basilica? Do we have time to walk on petit-Champlain street?"},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "You won’t be disappointed", "review_description": "Our tour guide Jo was great. Her tour was just the right amount of information and witty banter. The food selections were all delicious and we had a great time getting to know Ko and Montreal. I would highly recommend this tour."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "A worthwhile day out.", "review_description": "Communication was excellent from booking process and on actual trip. William our guide was knowledgeable and told us interesting facts and explained the history at our various locations.He managed to do this in 3 different languages."},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Excellent Food Tour", "review_description": "What a great tour.  The tour guide Jo was fantastic, we have done a number of food tours all over the world and she is the best to date! Food was delicious and the stories and background that went with it was great."},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great experience", "review_description": "Our guide Jo was amazing!!!  We got to do some wonderful tastings.  Far more than any other food tour we have done. Plus she told us a lot about the history of the area. Very organized as well!!!!"},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great Tour to get Quintessential Montreal Food", "review_description": "The food was amazing! Luca and Eric did a great job engaging with us and the group and giving us history and current perspective on Montreal food and the local area."},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great food and a fun walk!", "review_description": "We had a delicious food tour with Donna-Lynn who had lots of interesting information and history to share. Very enjoyable!"},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great Food, Culture, History and Fun", "review_description": "Alex was a terrific guide who hosted us through a culinary adventure in a culturally diverse neighborhood of Montreal. We were a mix of Brits, Canadians, and Americans with a shared purpose of  enjoying a sampling of street food Montréal offered. Alex did not disappoint. We were led through a gentle paced walk through the main streets and back areas of the district sampling Brioche to bagels, Poutine to Gnocchi, Poutine and a Schnitzel sandwich. Architecture, history and the stories of the immigrants who started our food stops were all touched upon. We ended the tour with a delicious Cannoli with a hot beverage of choice. All of us parted with full bellies, smiles on our faces and a sense of several hours well spent."},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great food tour!", "review_description": "Highly recommend. Great overview of food scene at Mile End. Came a little late but Simon helped me jump in on the third spot, saved me a pastry from the first, and doubled back to get me the second dish (street gnocchi-fun!). Loved trying poutine with smoked meat and the famous bagels. Got a list of other places to visit on a map. Overall had a wonderful time and am hoping to try out one of their other tours someday!"},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Éric the tour guide", "review_description": "Éric was an amazing guide even before we started the tour. I had all the info I needed to prepare. The food, the history and good company was exactly what we needed after a work conference. Make sure to bring your appetite because there is a lot of delicious food!"},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": "Great experience", "review_description": "Eric was amazing! From reaching out a day before and giving great advice for the tour. He was very detailed on our tour, from all the food and Montréal history. Food portions were great and very filling. Definitely recommend this tour."},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": null, "review_description": null},
{"attraction_name": "20. Montreal Walking Food Tour With Secret Food Tours", "review_title": null, "review_description": "I nee to book a hote nea the starting point for this tour, can you help me with a few options?"},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Not worth $$$- go in your own", "review_description": "I don't know if this tour is worth $$$. You can really take the Quebec trip on your own and maybe overnight. First stop was at a Mc Donald's for breakfast...a quaint French cafe would have been more worth it. Got to the falls and the workers were on strike and the tour company was totally unaware. The tour guide was ready to leave had it not been for me asking if we can view from the side, which we did. The falls was supposed to be the 2nd washroom stop but because the building was closed this wasn't an option. One lady therefore used the bus's bathroom and the driver was horrendously RUDE about it. Totally unprofessional and distasteful."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "All you want for a trip to Quebec", "review_description": "The guide, William was very knowledgeable, friendly and attentive and the whole day, though long was worth it to experience Quebec the way we did. Definitely worth doing."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "A day in Quebec worth it", "review_description": "The trip to Quebec was very worth it! Beautiful places to go in Old Quebec. The weather was also really good and we really enjoyed our time. The only thing was that the Falls were not open  but our guide Angela quickly found a way for us to at least visit the falls and take pictures. So we still had the chance to go inside the park and take a look at the falls. The cable car was closed but it wasn’t a big deal for us. Angela was also very informative, knowledgeable and very friendly. I loved having small talks with her and to learn about Montreal and Quebec. She was fully bilingual which really enhanced the trip experience. Thank you for this trip."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Perfect!!", "review_description": "recently visited this place with my four kids, and we all had an amazing time! From the moment we arrived, it was clear that the staff really put effort into making the experience enjoyable for families. The atmosphere was welcoming, and there was plenty to see and do, keeping the kids entertained throughout our visit."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Nice places", "review_description": null},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Excellent tour, courteous guides with well-planned itinerary and sufficient free time", "review_description": "Excellent arrangement with the right balance of guided contents (at Quebec City and Montmorency falls) and free time (3 hours) to explore the beautiful Quebec City.  Our drivers for both the hotel pick-up (a big plus given the 06:45 start time!) and the bus were courteous, punctual and drove safely.  Our tour leader, Joyce, was very polite, friendly and took care of all the group's needs.   Despite the rainy and windy weather on the day of our visit, we thoroughly enjoyed the trip and would recommend anyone to join this tour on your first trip to  Quebec City."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Picturesque Quebec City", "review_description": "We enjoyed the trip to Quebec City and Montmorency Falls; despite the rain we had a lot of fun. We didn’t expect the initial pick up from our hotel to be by car. I would like to have known that in advance. We met the bus at a central meeting point. Driver Alan and guide Joyce were very nice and friendly. First stop is the falls which are just beyond Quebec City. The cable car cost about $17 return. Once in Quebec City we were greeted by Richard who guided us on a walking tour. The walking tour goes from the lower part to the chateau at the top. Take the funicular if you want to avoid the steep steps, cost around $5 each way."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Good tour", "review_description": "Joyce and Jacky are great and super professional. We really enjoyed the trip with Joyce as Leader. Perhaps taking the VIP option of the trip was not the best decision as we saw no big difference for the extra price I paid beyond the hotel pick up service. Having said that, taking an Uber or walking would have been much cheaper than paying the VIP tour. "},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": "Great experience", "review_description": "The bus tour guide William did a great job explaining things and organizing our trip. His ability to speak 4 languages was quite impressive and he showed great enthusiasm. The local city guide Nicole was hard to understand and follow along with."},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": null, "review_description": null},
{"attraction_name": "21. From Montreal: Quebec City VIP Day Trip with Hotel Pickup", "review_title": null, "review_description": "Hola! Qué diferencia hay entre el tour de día completo a Quebeb que sale 97mil y el que sale 117mil?"},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Fulfilling day. Diverse and worth the price", "review_description": "The bus was super comfortable."},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Great Quebec City Experience", "review_description": "My friend and I were only in Quebec city for a few days so this is a great comprehensive tour to get to see all different parts of the city and the Falls. We really enjoyed the 4 hour trip and our driver spoke both French and English to accommodate everyone!!"},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Beautiful half day around Quebec", "review_description": null},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Great 1/2-day tour", "review_description": "Varied sites, very interesting. Would have liked more time at waterfall. Our driver & tour guide, Daniel, was excellent; good sense of humor, very knowledgeable."},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "We had a great time in Quebec.  Our tour guide Simon was incredible and supee helpful.  We enjoyed his sense of humor.", "review_description": "We spent 3 days in Quebec and selected the day trip.  Simon was our guide and he was great!  Great guide, great sense of humor and super informative.  We enjoyed speaking with him in our native tongue in Spanish.    Rhis was a grest 1/2 day wirh interesting stops and we are vey happy we got on it!  Recommend for the entire family."},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Quebec Arts and History Highlights", "review_description": "Great compact tour! Daniel, our guide, was knowledgeable, warm and efficient. The half day nature of the tour allowed us to have enough time to do our own thing in the morning and also set out on foot on our own afterwards."},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Excellent Guide", "review_description": "The guide did a masterful job of both driving and making commentary, the latter very informative and, at times, wonderfully humorous. You are lucky to have a guide like that."},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "To do absolutely!", "review_description": null},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Quebec city and more", "review_description": "Excellent day visiting stunning Montmerency Falls, Albert Gilles copper workshop and museum, Basilica Ste Anne De Beaupre and isle de Orleans including chocolate shop. Great guide providing insights into people, history and culture from the city centre right thru all stops and back into Quebec old town. We booked thru the best tourist bureau I have dealt with in the centre of the old town. Their help extended to making phone calls on our behalf to accommodation and bus companies. Highly recommend them and their half day tour plus the old city tour"},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": "Worth the trip", "review_description": "Excellent driver/guide Gary with a wealth of information. The bus was comfortable and so was the trip. We enjoyed every stop. Would highly recommend"},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": null, "review_description": null},
{"attraction_name": "23. Half-Day Trip to Montmorency Falls and Ste-Anne-de-Beaupré from Quebec city", "review_title": null, "review_description": "Is there a stop for lunch?   Or, should we bring a snack to eat?"},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Great views with informative formative guide.", "review_description": "Great trip with informative guide. We saw some great views of the mountains and waterfalls. Snow still in some places especially Lake Louise. We both really enjoyed it."},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Lake Louise, Marble Canyon, Emerald Lake, Natural Stone Bridge, Bow Falls", "review_description": "The trip was great.  A different tour was offered because  of the of year but nothing was a disappointment.  We had an hour at Marble Canyon, an hour at Lake Louise, 45 minutes at the village for lunch and then we headed to Natural Stone Bridge for photos, followed by Bow Falls and River.  Our driver Mike had interesting commentary all the way and we learned a lot about the area."},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "A Trip to remember ", "review_description": "The tour was amazing and Rhonda was an amazing guide. I'd definitely recommend this tour to anyone around Calgary..... "},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Wonderful and breathtaking", "review_description": "Beautiful day spent with the very knowledgeable Ben, he provided such great information and stories of the areas we were seeing . Kind and thoughtful. I would recommend that we have more time at Emerald Lake and Bow falls felt a-bit rushed. Very busy at the lunch stop with long waits but the sandwiches were delicious. All and all a great day."},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Super nice day!", "review_description": null},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "This Banff Lakes Tour was amazing.", "review_description": "Professional, punctual and very friendly. We had a great time with our guide Peter. Everything was well planned and organized."},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Winter Banff and Canadian Rocky Mountain Tour", "review_description": "Ben was an amazing tour guide! He was very friendly, informative and funny during the entire tour! The views and locations were absolutely breath taking! He was always willing to take our pictures and told us the best routes for exploring the area. We really enjoyed our entire day and would recommend this trip to anyone that wants to see the rockies!"},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Definitely worth it", "review_description": "This was a fantastic full day trip. Our guide, Ben, was  excellent. Funny, thoughtful and informative. We saw everything we wanted to,; there was plenty time- but we seemed to pack a lot in. "},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "Awesome experience", "review_description": "Ben was a fantastic guide - very informative and fun! We had a great group of people with us on the bus and enjoyed chatting to them. The sights were breathtaking and because the tour was well-organised we felt like we got to see so much in one day and everything ran on time. Can’t say enough how fab it was and how much we enjoyed the day. Thanks Ben and Banff ToDo!"},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": "A great tour and your guide!", "review_description": "This was a wonderful tour. Our tour guide was fantastic. He was so kind and knowledgeable. He helped my older mother up and down a tricky part of the track and she had such a wonderful time and got to see some incredible views that would have not been possible otherwise. We also learnt a lot about the area. The tour itself is so great - you get to see so many beautiful spots. Highly recommend!"},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": null, "review_description": null},
{"attraction_name": "22. Lake Louise Moraine Emerald Lake Johnston Canyon Banff Town", "review_title": null, "review_description": "Does this tour do Emerald lake and Moraine lake on June 14th 2026"},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Great experience", "review_description": "The trip included many visits which was great! The views were amazing and we have really enjoyed ourselves. Thank you to Shahz for being really informative, friendly and helpful while guiding the trip. I would definitely book again!"},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Good Tour", "review_description": "We we're really impressed with the tour. May seems like one of the best month's for the tour. It was well structured and we did a lot in the 9 hours. This tour covered everything. Shahz was a very experienced tour guide. I highly recommend this tourm"},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Amazing day out", "review_description": "Shaz was great , very informative and friendly. The tour itself was amazing, defo recommend seeing the falls on the boat and going behind."},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Please don't fall into this trap. This company (Airlink) has integrity issues and it does not only happened to me", "review_description": "This trip is a scam. I paid for the option that includes everything, including the cruise, Behind the Falls Tour and Skylon Tower Admission - with 183 USD. On the day, the driver buy tickets for all of us for the cruise, he didn't say anything. Then after I went on the boat and returned, he said that my package did not include the boat and ask me to pay him CAD48 in cash, I showed him the package I bought but he insists I need to pay him, so after a few arguments, as I don't want to waste everyone's time, I pay him and request a receipt, but he said that no receipt is available. He also said he will check with his company. "},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Great experience to Niagara Falls and all the rest", "review_description": "Had a good time on this trip. Got to see the falls which is something that I wanted to do for a long time. Our guide, Shohz was very knowledgeable and informative about locations on our way to Niagara as well as things we could do in the area. We had freedom for us to do what we wanted at times which I liked a lot. Would recommend this trip. The reason it’s not 5 stars is because the boat wasn’t available. I was aware that this wouldn’t be available due it being too early in the year but this wasn’t advertised on the page and some fellow customers were not aware if this. An update to the page description is needed."},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Not what I was expecting", "review_description": "Falls were incredible, tour guide Shahz was friendly and provided some fun facts along the way. I paid for the boat tour as part of my package and was told when on the bus that the boat tours were not happening. No offer for refund just told I would be doing the behind the falls tour instead.  I was very disappointed with this substitute and don't recommend if you happen to be given a choice."},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Good but didn't get what we paid for", "review_description": "Shahz was very friendly and knowledgeable.  Tour was good, views were stunning and weather was perfect.  What was not good was we paid for the boat Tour and were told that it wasn't running so instead we do the behind the falls. I did not enjoy that at all and am extremely disappointed that we were charged for something we did not receive ."},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Beautiful day at Niagara Falls", "review_description": "We were a small group and our guide was Shahz. We had the perfect weather and did do the “Journey behind the Falls” which was very wet and very beautiful - sadly, the cruise was not yet operating. We had plenty of time at the parc area overlooking the falls to take beautiful pictures. "},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Niagara falls", "review_description": "Nice guide, gave a lot of information about the area. But it was such a pitty we couldn’t go with the boat. I prefer to get informations before when program is changing… and I would prefer to spend more time at the important stops…."},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": "Tip...", "review_description": null},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": null, "review_description": null},
{"attraction_name": "18. Niagara Falls Guided Day Tour From Toronto with Boat & Tower", "review_title": null, "review_description": "Hi if I choose only cruise and tour one, am I able to go back to Toronto bit earlier?"},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Nice tour around the harbour.", "review_description": "A nice one hour ride around the harbour.  We did think that the person on the mic could have been a little more informative and easier to understand. Slow down, speak clearly and check your script for proper pronunciation.  The loud music between short chats was a little much.  All fine, we just thought more info would have been awesome. And a script would def help that "},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "A good option rain or shine but would be more enjoyable on a nice, sunny day", "review_description": "It was a cold day so riding inside was necessary. Seating is rows and rows of rickety chairs. The tour is of the harbor only so sitting on either side of the boat is fine because the whole ride is just a small loop around the harbor. There was some commentary about buildings and things which could have been more interesting/ funny.  I think we would have enjoyed it more from outside on a warmer/ sunnier day."},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Cold but worth it", "review_description": "It was 29 degrees and feels like 27 but was worth it to see the Toronto City from other angle and to take beautiful pictures. You can use the lower deck to mitigate the cold and go the upper deck just for few minutes. I recommend it"},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Great tour, absolutely make!", "review_description": null},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "A boat... atypical!", "review_description": null},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Audio guides not available in other languages, as advertised.", "review_description": "The day was beautiful, the boat clean and comfortable, staff very helpful and the coastal view of Toronto unique and stunning.  Although the Tripadvisor ad noted that audio guides were available in several languages, including French, the staff told us they have not offered this for several years.  Apparently they have asked Tripadvisor to update their ad but this has not happened.  We were very disappointed since our friends from West Africa speak French.  We did our best to translate but the guide spoke very quickly and so this was challenging."},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Very good and informative!", "review_description": "A very enjoyable and informative cruise. Our guide was very knowledgeable and friendly, we have learnt a lot about the city in the space of that one hour. Great views of the city and the islands, highly recommended!"},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Nice hour cruise to see the city", "review_description": "The boarding point was easy to find, the boat left and returned on time, the crew were friendly and helpful and the view of the city was excellent. Would recommend for anyone looking for an hour cruise to see the harbour."},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Great way to spend a relaxing hour", "review_description": "We throughly enjoyed our sightseeing cruise. We went on the 6.30pm one , just as the sun was setting and we got some fabulous photos  of the city."},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": "Toronto skyline Sunset views", "review_description": "Amazing views to the Toronto Skyline. If possible book for the 20:00 tour, because you will see a wonderful sunset behind the Toronto skyline."},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": null, "review_description": null},
{"attraction_name": "24. 60-Minute Toronto Sightseeing Harbour Tour", "review_title": null, "review_description": "Which boat tour stops at the centre island? Is it the Mariposa Oriola or the St Marie?"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Was great trip", "review_description": "Jason was an amazing guide. Very thorough with information pleasant to Be around attentive to our needs. I recommend  thank"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Sea to Sky whistler tour", "review_description": "Today, we went on the whistler sea to Sky tour, it is the second tour we have done with this company this week. Jason was our driver/tour guide today, he was excellent in every way, knowledgeable, friendly, courteous and the ride was smooth. He was also extremely helpful for those with mobility issues, patience is a virtue and he had plenty. Would highly recommend. Nothing was a bother."},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Most enjoyable day", "review_description": "Unforgettable Day Trip to Whistler & Sea to Sky Gondola – A Must-Do!"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Snow", "review_description": "The views were amazing and tour guide was excellent "},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Good trip to see several attractions", "review_description": "18 people took the trip.  We stopped at Horseshoe Bay, Sea and Sky Gondola and Suspension Bridge, Whistler and Shannon Falls.  Whistler was my least favorite of the stops but I loved the gondola and the falls.  It’s a long day, about 10 hours but it’s a great way to see attractions near Vancouver.  The driver, Leslie, was very knowledgeable and gave lots of interesting information about British Columbia.  Was worth the money to do this trip."},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Thrills and Relaxation in Whistler", "review_description": "This tour is stunning and our tour guide Jason Southern was amazing, the best tour guide I've ever travelled with. A perfect mix of personal stories and factual knowledge making for the perfect day. Would highly recommend this tour."},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "Amazing family trip!", "review_description": "We had an amazing experience with our tour guide, Jason, who took us on a day trip to Whistler and the Sea to Sky Gondola. From start to finish, Jason was incredibly attentive and made sure we were comfortable and well taken care of the entire time. He shared so many interesting facts and stories along the way, which made the journey even more enjoyable. The scenery was breathtaking, and Jason’s enthusiasm and knowledge really added to the experience. Highly recommend this tour, and especially Jason as a guide!"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "The best ever !!!!!", "review_description": "Excellent tour bus !!!!Jason it's a great men who make people laugh and feel safe into the bus my day was amazing 👏 thank you jason"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": "AMAZING", "review_description": "It was an amazing tour and it was even better than we expected, a big plus to the tour was Jason, our guide guy, he was great and gave us so many extra information and made the expirience even better!"},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": null, "review_description": null},
{"attraction_name": "25. Whistler and Sea to Sky Gondola Tour", "review_title": null, "review_description": "Hi, I have few questions:\n1) If I live in a house instead of a hotel, would you pick me up?\n2) I can't find the starting time? What will be the meeting time?\n3) Will I have to hike or walk a lot? I will come with a 65-year-old lady. \nThx"},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Great tour of the downtown ", "review_description": "Great way to see a lot of sites in the downtown including a lot of small things that you wouldn't normally know. Ida was terrific, walking at a comfortable pace and letting us know about buildings and their history. "},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Amazing Calgary tour", "review_description": "We just completed a walking tour of Calgary with Ida.Ida was bubbly and informative on the tour.The tour gave us a great overall idea of Calgary’s history.I would definitely book another tour with Ida."},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Excellent tour", "review_description": "Excellent tour.  Lots of depth.   Materials presented enthusiastically and clearly.    Would recommend as starting point for city visit"},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Go with Toby!", "review_description": "Toby is fantastic. She was knowledgeable,  proud of her city and showed us both the old and new sides of Calgary. We saw some great sites and met some lovely people."},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Wonderful walking tour", "review_description": "Jaime with his knowledge of architecture led us through this really neat city pointing out the different building styles based on time periods. The history of the Fairmont and the styles of the hockey arena, Music Hall, and library stood out to me.  My wife and I went to a Vietnamese sub shop that Jaimie pointed out and it was an excellent bonus too as well."},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Walking your downtown Calgary", "review_description": "Our guy, Darrell was very informative, casual, had a sense of humor. The pace was good and we really enjoyed it. We were lucky to have beautiful weather in April. Would recommend."},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Enjoyable walk thru Calgary history", "review_description": "We are here for just a couple of days, staying downtown. The walking tour was interesting and our guide was very knowledgeable about Calgary’s history. We saw several building with unique architectural features that we would have not noticed without our guide pointing them out. The tour pace was comfortable for our group of 15. Definitely recommend Toonie Tours."},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Great tour of the city", "review_description": "Jamie was an excellent guide ! We learned so much about the history of Calgary, the buildings, the ideology of what the city should be like for "},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": "Great for tourists or locals!", "review_description": "Jamie was amazing! He had so much knowledge of the city. We are locals but wanted to explore our city, and we learned so much!"},
{"attraction_name": "26. Gratuity-Based Calgary City Highlights 3 Hour Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "A bit boring", "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Good fall trip", "review_description": "Excellent tour of thousand island area filled helpful information; we were fortunate to have good weather most of 3 hours though it got cold last hour but found place to sit in covered floor"},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Great time!! Great tour!", "review_description": "I thought the tour was really great. I went on a Friday afternoon in October, so it wasn't crowded at all. They were punctual and the boat was great. I did a similar tour in Parrysound, so I knew what to expect."},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Beautiful area", "review_description": "Beautiful scenery but 3 hours is too long. Also it was hard to hear commentary over the intercom due to the loud boat motor."},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Yeah, great.  You don't see much of that in your life. Unforgettable", "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Fantastic scenery - book with another operator!", "review_description": "Very disappointed with this cruise, and it could have so easily been a fantastic experience as the views of the Islands and scenery is stunning. We were very lucky with the weather, warm and sunny. "},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Disappointed", "review_description": "We were unable to hear the audio narrative. I was right under a speaker but between people talking, babies crying, and engine noise, I heard maybe 20% of the narrative. My sister who sat on over from me could hear nothing. It would be nice to have a headset that one could use, if you wanted. We were on the 1st level close to the front."},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Superb cruise to the miles Islands", "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Very friendly and helpful staff, however!", "review_description": "We took friends from the US on your 3 hour cruise.  This is the fourth time we have taken family or friends to show the 1000 islands.  The cruise was excellent.  I understand  that you do not wish any food brought on the tour, however, is it necessary to charge almost 8$ for a bag of popcorn? It almost felt like I was at a Jays game."},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": "Nice cruise", "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": null, "review_description": null},
{"attraction_name": "27. 3-Hour 1000 Islands Cruise from Gananoque with views of Boldt Castle", "review_title": null, "review_description": "Reserved my tickets for July 22 2025.  Actual purchase paid for July 20 th.  Where will my tickets go?  Online?  Ticket booth,  my home address?"},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "May12/25 disappointing ride.", "review_description": "Tour guide did not connect with the passengers. She was difficult to hear, did not ask questions or engage conversation. Very robotic."},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Fun, calm tour!", "review_description": "The boat tour was funny and imparted good knowledge. Our guide Clementine was very helpful and passed on some interesting tidbits about the Montreal Old Port."},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "A Must While Visiting Montreal", "review_description": "This is a fantastic boat tour of the Old Port of Montreal. From the Captain to our tour guide, both were highly informative."},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Great experience!", "review_description": "The views were amazing and the weather was exceptional! The boat was open on the sides and covered on top, so not too much sun. Super comfy and enjoyable! Loved the drinks being offered right before we set off for the tour, and had a blast with my friends. Short, sweet and affordable!"},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Best scenic boat ride - we recommend!", "review_description": "This was a wonderful experience!  We were debating between this and a slightly larger boat from another operator, and all 6 of us agreed afterwords that we'd made the right choice.  Because the boat is electric, there are no fumes and no engine noise, letting us hear the informative commentary by the captain and the guide perfectly.  There are many beautiful views - when we weren't snapping photos we were just enjoying the view and the ambience.  Definitely recommend!"},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Nice boat tour", "review_description": "This was a nice activity for us to do on our last day. It was a 45 minute ride on a very small electric boat around the old port area. It was not super exciting, but we learned and saw several interesting things in the harbor."},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Very good bilingual service", "review_description": null},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "SS Minnow has nothing on these guys", "review_description": "Great 45 minute tour.  I have heard the 2 hour trip is overkill, this was just right. Great staff- easy booking and locating the starting point."},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "A lovely view", "review_description": "It was a gorgeous day to be out on the water, and the view back to the City was very interesting. Being electric we did not have to huff diesel fumes which made it even nicer. "},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": "Quick intro to Old Montreal from the water", "review_description": "The ride was a quick and interesting view of Old Montreal from the water. The staff shared stories and information about the St Lawrence waterway, the city of Montreal and other sites  along the ride. The boat is small but it was a comfortable ride and seems well maintained. We liked that they spoke about the ecological advantages of the electric boat. The staff spoke both French and English and shared all information in both languages. They were clearly safety conscious. "},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": null, "review_description": null},
{"attraction_name": "28. Montreal: Guided Electric Boat Cruise with Onboard Drinks", "review_title": null, "review_description": "Where can you park?"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Fantastic Tour with Excellent Guide", "review_description": "Rob picked us up (perfectly on time) and guided us for the duration of our tour. As we were a smaller group, he even managed to squeeze in a few extra stops. The tour covered everything described in the itinerary and Rob was a font of knowledge who gave extra depth to each location with interesting bits of information. This trip was a highlight of our holiday, thank you Rob!"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Rob made the tour", "review_description": "Rob tools us all over the area making many stops outside the norm. He was born and raised in the area so has lots of history and stories to share. There is just Rob and his son so you are guaranteed a great tour guide."},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "The BEST tour guide", "review_description": "It was so informative and visually spectacular.  There were many photo opportunities.  Our guide was extremely informative and sensitive to the groups ages and limitations as well as abilities.  "},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Great insider's tour! ", "review_description": "Rob is a great guide and the tour feels more like a family member taking you around to see their stomping grounds than being led by a \"tour guide\".... very nice,  easy,  informative and \"local\" feel!"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Amazing tour", "review_description": "Robbie (I believe was his name) was an incredible host; very polite and informative with good humour. His dog is also very cute and a nice companion for the trip. The tour bus collects you at your accommodation and is well-warmed throughout the journey, and each stop is planned well with a good amount of information. It’s very clear how good it is to be shown around someone who clearly enjoys the area and has good knowledge of it. There are plenty of opportunities for you to take photos of the area, with great time to soak in the scenery before moving onto the next spot. "},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Stunning Views!", "review_description": "This trip was amazing!!! Our guide was phenomenal at being friendly, and shared interesting information about the sites. The views were amazing, and we got great pictures. The weather was incredibly cold during our trip, and the tour was a perfect amount of time in the van and visiting at each stop. Would highly recommend this tour and tour guide!"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Best Way to See the Banff Lakes", "review_description": "There is probably no better or safer way to visit all the lakes in Banff National Park. It was snowing when our family did the tour and our guide was a very good driver. We just sat back and relaxed. He was such an expert at the area we didn’t take one wrong turn. He knew where the best and cleanest bathrooms were and where to have lunch or get a hot coco."},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Solid Ten Out of Ten - Awesome Experience!!!", "review_description": "What an absolutely awesome tour provided by Rob, highly recommend! He's very knowledgeable, witty, kind and patient. It was so nice to just, look at the scenery and not have to worry about parking. Very clean and comfortable riding vehicle. He's a great photographer too!!! We beyond thoroughly enjoyed our day. Thank you again Rob!!!!"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": "Fantastic day", "review_description": "Rob was a great guide and a careful driver.  He was ready to take photos.  He was knowledgeable about each site and went out of his way to point out the Larch trees I was interested in.  Family owned business!"},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": null, "review_description": null},
{"attraction_name": "29. Lake Louise, Moraine Lake and the Icefields Parkway Full-Day Tour", "review_title": null, "review_description": "Does this tour pick up and drop off from the rimrock hotel?"},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "This is a “must do” trip!", "review_description": "The trip was absolutely a 5!    Joe and Carol went above and beyond on this trip.   Joe found two pods or families of Orcas.   Carol was excellent in explaining everything about the Orcas.   They were so knowledgeable!    Great trip!"},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "111% Recommend", "review_description": "Very good experience - we took the faster uncovered boat and they took us almost all the way out of the strait of Juan de Fuca to watch the whales. Definitely recommend warm layers as the fast boat is FAST but you don't get wet, nice high sides and comfy seats. We watched a young humpback breach and fish in a bay for a while. It was magical. The guide and boat operator were exceptionally knowledgeable."},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Successful whale watching trip with Eagle Wings", "review_description": "We couldn’t have asked for more from our trip, we saw whales, seals, eagles and even a sea otter plus many seabirds and other animals."},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Fantastic day.", "review_description": "We had a great day thanks to Eagle Wing! We've seen orcas, sea lions, harbour seals, a sea otter. Two of Eagle Wing's photographers made great pictures of which we received free copies in our email!"},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Excellent wildlife and whalewatching experience", "review_description": "This whale watching tour was amazing. Derrick and the tour crew were excellent. We saw goats, sea lions, eagles, orca. Derrick explained everything about the area we were in and about all the wildlife we saw with very experienced knowledge. What a wonderful day!"},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Excellent", "review_description": "Very beautiful, comfortable, safe, and exciting adventure.  Definitely would do it again. The staff were knowledgeable, inclusive, and attended to every detail."},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Whale watching boat ride", "review_description": "The boat ride was fat and fun. We learned about various island history and the safety instructions were clear. The crew had charisma and were engaging. We had the option of being outside or inside the cabin to warm up."},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Great day out", "review_description": "We found the service excellent, the staff were knowledgeable and easily available to all passengers to keep them informed. Having jackets and hats available free of charge kept us warm and the semi-covered boat was a great option."},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": "Amazing tour", "review_description": "Would highly recommend this, we saw amazing wildlife the crew were very informative and we got to spend a while watching the Orca whales while surrounded by stunning scenery"},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": null, "review_description": null},
{"attraction_name": "30. Victoria Whale and Wildlife Cruise", "review_title": null, "review_description": "I would like to know if the open boat would be too cold on June 1 at the 9am cruise time."},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Great experience!", "review_description": "Excellent 2 hour evening stargazing walk with Euan and Isla. Well organised and friendly experience. "},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Amazing view of the stars in the national park", "review_description": "We were met at the cave and basin visitor centre car park by Euan, who turned out to be a very knowledgeable guide. He took us into the national park along the path, which was easy to navigate and fairly flat. Euan stopped at a number of viewpoints , and he explained what we were looking at in the sky. He also gave us some guidance on how to effectively use our smartphones to take photos of the night sky. Euan made sure we stayed together as a group pausing as necessary to allow slower walkers to catch up. The whole experience took 2 hours, and we walked some 3 miles, although it neither felt like 2 hours nor that we had walked 3 miles. Would highly recommend to anyone visiting Banff who is looking for something different to do after dark."},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "def unique, really cool", "review_description": "we really loved it.  beautiful walk, Eun (probably not spelled correctly!) was a really great guide!  he was very knowledgeable about the stars and had some great stories about the area."},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Unforgettable night hike", "review_description": "Absolutely amazing experience stargazing on a night hike in Banff with Eun! From start to finish, it was unforgettable. Eun was not only incredibly knowledgeable about the stars, constellations, and celestial stories, but he also shared fascinating history and insights about the land, the mountains, and the national park. His passion for the area was contagious."},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Impressive and amazing tour", "review_description": "Hands down the best tour guide I’ve ever had! Super knowledgeable and friendly. Amazing views! Would recommend to anyone and everyone"},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "AMAZING tour!!!", "review_description": "We had the BEST time!! We went for our honeymoon and this was the highlight of our trip. You walk through a gorgeous forest and the guide stops to tell local stories, give history, and point out constellations. He even showed us how to take gorgeous pics of the stars with our phones, which gives us pics to look back on for forever. The guide was kind, funny, goofy, and knowledgeable. We would absolutely do this tour again."},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Wonderful host and beautiful night sky in Banff", "review_description": "Jacob was a great host and very knowledgeable of the area and history of Banff and surrounding areas!  We had a great time and highly recommend this trip!"},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "great experience!", "review_description": "Jacob took us through Banff backcountry pointing out constellations, telling stories, and looking for animals! He’s a great, knowledgeable guide and we had a lot of fun!"},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": "Great experience", "review_description": "Food was amazing it was our first experience in Banff with amazing  view, delicious food and such a great personal in bistro. thank you Amy"},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "31. Banff Sunset and Stargazing Tour - 2hr Walking Tour", "review_title": null, "review_description": "Hi, I am travelling alone, I am wondering if I could pay a fee or something for a pick up or drop off to the tour meeting point from the town as I don't drive"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Great tour of places with unusual histories", "review_description": "The lady who ran the tour did a wonderful job of staying in character while describing the Gastown area of the late 1800s era. The places we visited were not special in themselves but the stories she told about them brought them to life and made you feel like you were there at that time."},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Entertaining", "review_description": "It was a little hokey at first but fun and interesting. A nice way to learn more about the history of the city. Our guide was really into her character, and that was the lens through which she told the stories. I appreciated that she shared what was true and what was embellished at the end. :-)"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Great Walking Tour", "review_description": "Awesome experience. Our guide Cole was amazing and told the history of Gastown in an interesting and fun way. I would definitely recommend this tour."},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "A great way to spend an evening in Vancouver!", "review_description": "We enjoyed the Forbidden Vancouver Walking Tour, Lost Souls of Gastown with guide Amy Lee.  Not only was it informative it was interactive and theatrical, providing a background, context and history of this complex area of Vancouver.  It was great for our 16- and 13-year-olds along with mom and dad.  The tour was about 1 ½ hours and we walked over most of Gastown.  A great way to spend an evening in Vancouver."},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Super tour!", "review_description": "Our tour with Amy was wonderful! Lots of great info. What a great way to spend a night in rainy and lovely Vancouver. Hurray!"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Perfect balance of historic, humorous and horrifying", "review_description": "We had a great time!  Perfect balance of historic, humorous and horrifying.  Kennedy was a great tour guide.  It was drizzling, but we brought umbrellas to stay dry and bought hot coffees at Monaco Cafe prior to starting the tour to stay warm.  Amount of time spent on tour was appropriate along with the amount of walking.  It was definitely an experience that we all enjoyed!"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "A great walking tour", "review_description": "Definitely reccomend doing this. I went with my girlfriend and we were hooked on the story being told. Gas town has a surprisingly rich history. The tour guide provided a lot detail and was very passionate."},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "So worth the money!", "review_description": "Hemm guided us through Gastown and history in such a realistic, entertaining way,   One felt like living in the late 1800s for 90 minutes!  Can only highly recommend it!"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": "Highly recommend", "review_description": "Incredible storytelling, fantastic performance, and a wonderful, respectful account of the history of the neighbourhood. Highly recommend. Our actress, Amy Lee Newman, gave a phenomenal performance and ensured this was such a unique and special experience. 10/10"},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "32. Vancouver Lost Souls of Gastown Walking Tour", "review_title": null, "review_description": "Is it handicap scooter accessible?"},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Time well spent", "review_description": "Enjoyable and informative afternoon. Daniel did an excellent job and provided many recommendations/tips for visiting Vancouver. This is a great introduction to the city."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Wonderful", "review_description": "Alexis was a wonderful tour guide. Gave us lots of tips for things to do in Vancouver and advice for our on going trip to Vancouver Island and through the Rockies. His love for his home city shone through."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "The tour was fine", "review_description": "The guide was good, I don't recall his name, Daniel maybe?  For someone here for the first time, the tour would be good.  It didn't cover enough for me.  I wanted to see and learn more than we did.  Also too large a group, almost 25 people. Moved a bit slowly for me."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Very pleasant walk in the iconic places of downtown Vancouver!!r", "review_description": null},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Good background tour of Vancouver", "review_description": "Daniel was very informative & gave us some historical facts about the city. We had time for a break at the public library which itself was interesting"},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Vancouver delight", "review_description": "Our guide Andrea was an absolute delight. Knowledgeable, excellent articulation and thoroughly aware of the needs of her group. Goodness me what a cracking afternoon……we learnt so much about the city, its architecture, its history its people……..BRILLIANT!"},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "A great way to learn about Vancouver", "review_description": "Samuel was knowledgeable and very friendly. It was a little tough to find him at first in the crowded Canada Place area, but he did a wonderful job."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Toonie tours is a joke and so are their guides", "review_description": "I don't know. I'm trying to post this again. There's gonna hide it. They were an absolute joke of a tour. I've been on these tours all over the world. This was hands down the worst one. I'd ever went on. The tour guide had only been living in Vancouver 4, something like 8 months. He was from another country, a European country. He had a broken English, extremely strong accent to the point where you could not understand him. If there was any noise at all, he knew absolutely nothing about the city or the tour that he was trying to give 5 people left the tour because he clearly knew nothing and would just make up stuff. If someone asked a question, he just made it up at 1 point we're literally standing in front of BC place, which is where the CFL please, and the professional Soccer team plays. And somebody asked, is this where the Soccer team plays? And he said, and I quote, they don't have Soccer here in Canada. Nobody in Canada likes Soccer for some reason, so they don't have it. I stopped. I looked at him and said, you're joking, right? You know, Vancouver has a professional Soccer team and then I said, look up as we were standing right below 2 of the signs for their Soccer team right in front of where the Soccer team plays. The guy was the most incompetent uninformed person I had ever met in my life, and he was trying to tell people how much they should tip him before the tour even started. And he literally said, the minimum is $30. The guy is pathetic. This place is a scam. Anybody can join it.They just do it because it's easy money for them and tourists don't know better."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Walking Tour of Vancouver", "review_description": "We had an amazing time with our knowledgeable and friendly guide Daniel.  Although we have visited Vancouver in the past, today we had the opportunity to visit many locations we didn’t even know existed.  There were many highlights on this tour including a visit inside the Marine Building and the Vancouver Library.  The tour was well paced and we exceeded our goal of 6,000 steps."},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": "Would highly recommend", "review_description": "The 3 hrs tour around Vancouver with Daniel was absolutely 💯.  His knowledge of Vancouver shared valuable information about sites that you would overlook. It was a great tour and very much worth it. And Daniel, all the best for the future"},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "33. Gratuity-Based Vancouver City Highlights 3 Hour Walking Tour", "review_title": null, "review_description": "What time are you starting on Mon 5 Aug. Also, are the morning walks starting from the same location? Five potential customers from England asking! Thank you."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "May 2025 tour", "review_description": "Daniel was great, very knowledgeable and funny. The drive through the pass into Canada was beautiful and Daniel made it very informative and entertaining"},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Brilliant tour", "review_description": "Great tour. "},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Wow what an amazing tour and guide", "review_description": "Daniel was absolutely amazing tour  guide! He was super informative, knowledgeable and we thoroughly enjoyed our day with him. Definitely worth the visit and thanks again to Daniel and thanks to him we got to see a bear!!!!"},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "We went on the Triple Combo Skagway Tour and it was fantastic. We travelled through the mountains and made fun stops.", "review_description": "Daniel, our Tour Guide, was fantastic. Beautiful tour, cute puppies, fun bear-sighting, interesting stories and very accessible  for all ages."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Fun family excursion", "review_description": "Daniel has a smooth radio voice and is an excellent guide. The tour was perfect with enough time at all stops.  We really enjoyed the bridge and the. Chili at the cafe."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Fun time!", "review_description": "Daniel was great! Very knowledgeable and personable. We really enjoyed the scenery and had some good laughs along the way."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Amazing! Do not miss!", "review_description": "The views were amazing and Daniel made it a super memorable trip. He even found us a black bear and tried to connect with every person there. The best tour I’ve ever done and the puppies were a blast!"},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "Triple combo tour", "review_description": "Daniel made our triple combo tour both informative and fun! We really enjoyed our time and would go with this company again."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": "10/10 recommend", "review_description": "This trip was the perfect blend of activities and beautiful scenery. We even saw a black bear! No one has ever been sad holding a puppy so the musher camp is a must do. The suspension bridge surprised me with how worthwhile it was. Daniel was amazing! He answered all our questions without being duplicative of information we’d see in stops on the tour. Definitely got more in value than we paid for this experience - would absolutely recommend."},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": null, "review_description": null},
{"attraction_name": "34. Bridge, Puppies, and Summit Triple Combo in Skagway", "review_title": null, "review_description": "Are you open in late September and first week in October?"},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Very nice experience ", "review_description": "Very nice experience, the guide was very kind and interesting! The tour was beautiful I very much appreciated seeing what is going on outside Halifax "},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Great Basic Tour", "review_description": "Our driver made this super easy.  We were picked up and dropped off at the door to our hotel.  The van was designed to fit more people than for comfort, which was unfortunate.  We did not have nearly enough leg room, and as the drives between locations were usually an hour plus, this was painful!  But our tour guide was knowledgeable and helpful, and we felt we got to see all the important sights!"},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Awesome Tour", "review_description": "This tour was awesome! Arjun was very friendly, knowledgeable about sights and made sure we all had a great day. Oh great music play list too!"},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Peggy’s cove and Lunenburg", "review_description": "Amazing tour of Peggy’s Cove and Lunenburg! Our guide was friendly, informative, and made the whole experience memorable. Beautiful views, great stories, and smooth planning. Highly recommend!"},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Great compact tour", "review_description": "It was a great trip you need to be aware that there will a bit driving time but as well enough time in the city. Peggy’s cove is a nice place and Lunenburg has a fantastic little town area. In April it’s not quite the season, so it was not much going on. But shops and restaurants were open. All in all a wonderfully experience with the last stop at the graveyard and perfekt for people who have no own car/just visiting."},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "3 highlights in one trip!", "review_description": "A wonderful experience from pick-up to drop-off. Communication prior to the day was excellent. We were lucky enough to have a VERY small group, so our driver/guide, Arjun,  was able to chat and answer questions easily. "},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Always recommended", "review_description": "It was one of the most memorable trips we’ve ever had."},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "Marvelous", "review_description": "Our experience with Alpha Tours and Travels was exceptional! They crafted a perfectly tailored itinerary that catered to our interests. They navigated us to breathtaking beauty of Lunenburg and Peggy's Cove. I am excited to go for next trip with Alpha Tours and Travels. They are the best"},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": "The tour was exceptional", "review_description": "We had a blast at Peggy's Cove, Lunenburg, and the Titanic Cemetery!  Our guide was awesome – super clear and thoughtful, making the whole trip easy and fun.  Alpha Travel & Tours gets a huge thumbs-up."},
{"attraction_name": "36. Peggy's Cove, Lunenburg and Titanic Cemetery Full Day Tour", "review_title": null, "review_description": null},
{"attraction_name": "38. From Montreal: Quebec City & Montmorency Falls Full Day Trip", "review_title": "Scenic waterfall and old Quebec City tour", "review_description": "The tour leader Joyce was very good in her language skills, taking the effort to explain in English, Mandarin & French to the group"},
{"attraction_name": "38. From Montreal: Quebec City & Montmorency Falls Full Day Trip", "review_title": "Beautiful day in Quebec", "review_description": null},
{"attraction_name": "38. From Montreal: Quebec City & Montmorency Falls Full Day Trip", "review_title": "Great trip!!!", "review_description": null},
{"attraction_name": "38. From Montreal: Quebec City & Montmorency Falls Full Day Trip", "review_title": "Great excursion!", "review_description": null},
{"attraction_name": "38. From Montreal: Quebec City & Montmorency Falls Full Day Trip", "review_title": "Great day trip to Quebec", "review_description": "We had a wonderful well spent day trip from Montreal to Quebec. Our tour guide Mr Yu was amazing, knowledgeable and had provided the organized trip. He speaks English, French and Chinese throughout the trip, that's already impressive.  We had not had early breakfast in the morning and it's great that the trip includes McDonald's stop along the way to grab the breakfast. Then we headed to ice hotel, if you had not purchased the ticket during booking you can pay cash at the bus. The next stop is water fall. Then the last stop is beautiful old town Quebec. Mr Yu has helped with many recommendations, we had the best maple latte and pistachio rolls in Le Petit Dep coffee shop. We appreciate their flexibility to allow us to join the trip one way and brought our luggage on the bus because we are staying a night in Quebec, next day return back to Montreal by train. Not to mention our driver Mr Steve, he is very efficient driver with a skill, a pleasant guy. I would recommend this trip if you have limited time to visit Quebec. Trip itinerary is slightly different in the winter vs summer."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Very informative", "review_description": "Sherry ( like the Spanish wine) was our driver. She drove very well and was funny and informative. The buses were clean and modern."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "The unreliable big bus", "review_description": "Can’t recommend this rip off. Took for one afternoon and we were so disappointed we didn’t return the following morning. Unreliably infrequent buses make for over long waiting and guessing when the next bus might arrive. Much of central Vancouver is very walkable and there are relatively few high interest sites compared to many other hop on and off city tours in Europe. The two stars are reserved for one driver Sherry who lifted my despond on the last trip. Poor value for $75"},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Waste of time and money", "review_description": "Waste of time & money."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Bus driver saves the day!!!", "review_description": "I want to give Sherry, my last bus, driver a zillion stars. She was phenomenal —gracious, funny stories, and cute jokes.  She made my second and last trip wonderful—giving Vancouver some personality.  The first ride on the Big Bus had a taped tour guide and I wasn’t expecting that.  The busses are clean and well lit—but tour guides like Sherry are game changers."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "HOHO Vancouver 5/10/25", "review_description": "Sheri is very informative, friendly and lively…. she is the only one that’s really giving information…. i hope to board on her bus tomorrow!!!! "},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Sherry like the Spanish wine", "review_description": "Sherry was terrific.  She was welcoming, knowledgeable and funny.  It was a great way to see Vancouver when short on time."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Vancouver Hop On Hop Off not up to par", "review_description": "We usually enjoy the city tours of Hop On Hop Off buses but this was NOT up to our expectations.  The commentaries were not but a few sentences for each city area and the waits for a bus went from 30 minutes at lunchtime to an hour at 5 pm. Even though buses were supposed to run until 7:30, the bus we boarded at 5:30 was not going the full loop and several people couldn’t get back to their destinations because the driver said it was time for him to go home. "},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Have Sherri train your drivers", "review_description": "The 1st driver was completely silent.  He never introduced himself, provided any narration or even informed us of what stop we were at."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": "Nice tour of Vancouver", "review_description": "Sherry was great. Would love to have stayed with her all day. Rated it a four instead of five because one of our buses had a problem with the air-conditioning and it was a little toasty. Otherwise it was great and super helpful to have transportation throughout the day."},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": null, "review_description": null},
{"attraction_name": "37. Vancouver City Hop-on Hop-off Tour", "review_title": null, "review_description": "The website FAQ says \"All Tours and Hop-On, Hop-Off services require a reservation.\" Does this mean I can't buy a ticket at any stop, like every other HOHO I've ever been on?"},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Great tour of Montreal", "review_description": "This tour company did a great job of showing us the major attractions around Montreal. The bus driver and the tour guide were very informative, and I would highly recommend this tour to anyone visiting the city who wants a comprehensive view."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Informative City Tour", "review_description": "The tour lasted about 3.5 hours.  Perhaps a little long.  Tour could have been shortened 2.5 hours as some parts of tour went through uninteresting areas.  Both tour guide and bus driver were friendly.  We had a chance to get off bus 3 or 4 times."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Great tour that is worth your time.", "review_description": "Our family really enjoyed our tour.   We had the opportunity to see parts of Montreal that wouldn't have gotten to on our own.    Our guide Richard was fantastic and very knowledgeable.    I'd highly recommend to all!"},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Great bus tour", "review_description": "I usually don’t like bus tours but loved this one. It was too cold to do a walking tour. Richard, the tour guide, was very amusing. The tour was a great overview of the city. Highly recommend."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Great tour", "review_description": "I took the Montreal City Sightseeing Tour with Live Commentary, I only had a few hours free before I had to fly back home. It was a great way to explore the city! Perfect timing and fun to do a few interesting stops for pictures and lunch."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Montreal City", "review_description": "I recently took the Montreal City Sightseeing Tour with Live Commentary, and it was a fantastic way to explore the city! If you're short on time but still want to get a great overview of Montreal, this tour is perfect."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "TripAdvisor Made Our Montreal Adventure Unforgettable!", "review_description": "TripAdvisor helped me a lot during my family tour to Montreal City. The recommendations were spot-on, making our trip smooth and enjoyable. It is the go-to site for travelers who love to sightsee and explore new places with confidence. Highly recommended."},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Wintery fun", "review_description": "Frank, our driver, was such a good master of the wheel; despite the snowy weather, we whisked around the city no problem. Our tour guide also was so polite and so professional and peppered his stories with humorous anecdotes and cool facts about Montréal. I enjoy travelling solo and exploring but the great benefit to joining group events like this is that you'll be shown things you wouldn't have known to visit on your own. I really enjoyed my winter experience and recommend it!"},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": "Excellent tour!", "review_description": "Excellent tour for 3 1/2 hours and would highly recommend.  Francois was so very knowable and enthusiastic about his work and explaining about each part of Montreal, from the old to the new - so much detail, told with a smile and a sense of humour.  We had a tour on 24 December 9am'ish and Grayling picked us up from our hotel St Sulpice.   Our driver was fantastic as well!  Do not know how our driver managed to drive in all that snow and manoeuvred  the coach so brilliantly - he was marvellous and extremely experienced.  Both Francois and our driver are a credit to the company.  Would highly recommend this tour as it is a brilliant start to your stay in Montreal.  Thank you,"},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": null, "review_description": null},
{"attraction_name": "39. Montreal City Sightseeing Tour with Live Commentary", "review_title": null, "review_description": "Where is check out page to view the hotel list to pick up?"},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Go for it!", "review_description": "We were very happy to have a beautiful day t walk the bridge and the tree tops. It's more commercial than one would like but I understand that. The crowds were smaller seeing we started at 3:00 p.m. had a beer and a poutine afterwards by one of the fire pits. I would recommend especially with kids, it seems very fun and interesting for young children."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Liam hard knock", "review_description": "Liam Clancey, Operations Manager gave us such a hard time with answering questions for the Tourism Challenge, and we weren’t given the questions that needed answering when we checked in."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "What a morning!", "review_description": "Free shuttle got us there early, less crowded. The suspension bridge was awesome but the more folks, the more wobbly it felt— just never scary at all . We also loved the treetop bridges. Very educational & historical signage all around Nice staff, great gelato, huge gift shop, lots of places to relax. Was even better than expected!"},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Great adventure close to downtown Vancouver", "review_description": "The suspension bridge park is a short drive from downtown Vancouver, or Stanley Park. There is a free shuttle bus if you don't have a car. There is paid parking across the street. We arrived about 9:30 and were glad we did so it wasn't crowded. The park was beautiful, even in the rain. We spent between 2 and 3 hours exploring."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Meh", "review_description": "I have been here before but this time I bought my two sons who are aged 20 and 21.  They weren’t really impressed.  They said it was “ok”.  For the price, I don’t think it’s worth it.  I think if you did your research you will find there are other suspension bridges around which are free."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Good fun for all ages", "review_description": "Well worth a visit. Got a free shuttle bus from the harbour area, which runs every 30 minutes, to the park. Fabulous suspension bridge and walks high in the trees, and a “cliff” walk. Very interesting information boards, and staff members were very knowledgeable."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Lovely.", "review_description": null},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Worth seeing - if you're ok with the ticket price", "review_description": "The bridge is just the beginning! The Treetops Adventure and Cliffwalk are also very fun adventures. The free shuttle from several locations downtown is very convenient. Taking off one star because although it was a memorable outing, the ticket price of over $300 for 4 people is very high."},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "A gem just outside the city of Vancouver", "review_description": "What an amazing place within 15 minutes via a shuttle from Vancouver! It was a slightly rainy day which did nothing to dull the beauty and the experience! Because it was cloudy we could appreciate the millions of little lights everywhere and can only imagine how beautiful it must look at night! Loved it all!"},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": "Beautiful park with amazing views - lots to do besides the incredible bridge!", "review_description": "After seeing videos of the bridge online, we knew it was going to be incredible and it was! But we were more impressed by both the Tree Tops and Cliff Walk features! They are truly feats of engineering and so much fun! The folks who work there were so friendly and helpful and while just the two of us went, there were so many families in attendance because there is so much for kids to do!"},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": null, "review_description": null},
{"attraction_name": "40. Capilano Suspension Bridge Park Ticket", "review_title": null, "review_description": "it says that the duration is 2 hours so i am confused? is the shuttle hourly and i pick which two hours i want to go for?"},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Excellent, everyone love it", "review_description": "Excellent view and diner , food was ok, service was ok, but for the price you get everything, many activities are included, worth the trip"},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "All right.", "review_description": null},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "My favorite view in Niagra, with a meal!", "review_description": "It was off season so they offered dinner at 5 for a discount and it was delicious. This was my favorite thing we did here. We had the best view of the falls with facts in front of the windows as we revolved. After dinner we walked up to the viewing area but our view below had already wowed us."},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Niagara Falls on a day trip", "review_description": "View at this height is truly amazing. Since I did not check in to any hotels at the area, this is the next best place to view the Fall"},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Average dinner with above average views", "review_description": "We had dinner in the revolving dining room and thar was special. The views from the booth are a little obstructed but overall still very good."},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Nice Experience", "review_description": "Food was good (actually better than Mortons imo). Servers had zero personality but were fine. It felt a little cramped but not sure that could be helped with the shape of the restaurant. I had prime rib, my son had filet mignon, both very good. But the views! Amazing. Expensive but glad we went."},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "One of  few ways to see Niagra Falls from above", "review_description": "Worth doing if you aren’t going to have another chance to see the falls from above. We also rode the Ferris wheel and had dinners at Massimos Sheraton and Table Rock. Probably could have skipped this."},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Beautiful views", "review_description": "Very fun.  You really get a great view of all of Niagara.  It is fun going up to see and would suggest for families, couples, and such.  You got to experience it at least once."},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "Amazing views, cheaper $ direct", "review_description": "FWIW, TripAdvisor has C$23 listed, and the tix on the Skylon.com site are C$18 adult/$9 child. If you know you’re going, don’t waste a $5 booking fee 🤷🏻‍♀️"},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": "...... also seen from above......", "review_description": null},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": null, "review_description": null},
{"attraction_name": "41. Skylon Tower, Niagara Falls Ontario Observation Deck Admission", "review_title": null, "review_description": "have about 4 hours available on a Sunday morning in May. We will be coming from the American side and need to be back to Rochester airport by 3:30 PM. Are there \"timed tickets\" for the tower? What would you suggest we attempt to see and in what order?\nIs reserving a table for lunch in the Skylon Tower a time sensitive means to combine lunch and see the tower (and save time)?"},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "A unique experience", "review_description": "The tour was very interesting and entertaining.  We really enjoyed ourselves our guide was a great storyteller! You won’t be disappointed."},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Excellent Guide - Asher", "review_description": "Had the pleasure of having Asher as our guide for our Spring Ghostly tour. Very happy with the experience, he was very engaging and immersive when telling the stories and did a great job tying the location to the story he'd tell. Definitely hope to get him as a guide again in the future."},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Great tour ", "review_description": "My husband and I did a tour with our teenage nieces. Our guide was Fiona and she was great. We all enjoyed her stories and loved learning some interesting history of Victoria. I have been on several of these tours and highly recommend them for entertainment and learning a bit of the town's history."},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "APPALLED JUST APPALLED!!!!!", "review_description": "We went 2 a FAMILY FRIENDLY market , they had a stand set up by donation for a short ghost tour. "},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Great time with Asher the tour guide!", "review_description": "Asher was a wonderful storyteller.  We had a great tour of all that is spooky in Victoria.  I would not hesitate to take this tour. It is not too long and easy walking. Stories are interesting and actually have ghosts in them!   We had a great time!"},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Spooky storytelling at its best", "review_description": "Want to hear some historical spooky stories about Victoria then this is your tour. Some very interesting facts are revealed amongst some awesome storytelling as you walk and weave your way from the visitors centre up to Bastion Square. Believer or not these stories are creepy and will have you looking around as the sun sets and darkness settles on this very haunted city. Our guide for the evening was Chris and with his sense of humour and masterful storytelling he made this tour a great experience even though we were chilled to the bone from the unforgiving wind."},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "A great way to get ghosted!", "review_description": "The guide for our tour, Zack, had great storytelling skills, including how to vocally project amidst occasional winds and the vibrancy of downtown. With a good story mix, an unrushed pace and easy walks to the locations, it was entertaining—and “spiritually uplifting”!"},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Wonderful evening stroll, local spirits", "review_description": "What a fun way to learn about Victoria and enjoy a short walk through town. "},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": "Jason is an awesome tour guide :)", "review_description": "The Ghostly Walks Tour was pretty cool. Love the gruesome ghostly history. Our tour guide Jason was funny and perfect for telling the tales and taking us around Victoria."},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": null, "review_description": null},
{"attraction_name": "42. Ghostly Walking Tour in Victoria", "review_title": null, "review_description": "How far is this tours starting point from where  the Holland America cruise ship docks in port?. Is it within walking distance?  We will only be in Victoria for 4 hours in the evening and trying to find something to do. Thank you!"},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Had a wonderful visit to Banff are second time this year. We always book with Brewster.", "review_description": "The driver Brain was so accommodating and pleasurable knowledgeable and very helpful with the kids. Thank you Brian R."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Maligne Lake Cruise Cancellations", "review_description": "Management has already cancelled the Maligne Lake Cruises through August 15th -with refunds.  We have a cruise scheduled for September 11th - we will either take the cruise if the Park is open, or accept Management's cancellation if not.  This will be a repeat for us; enjoyed very much a few years ago."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "WILDFIRES and MALIGNE LAKE BOAT CRUISE", "review_description": "We are told we cannot cancel.  Jasper National Park is  closed due to wildfires and damage.  Why should we still have to pay?"},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Don’t miss it", "review_description": "This has been such an humbling and soul healing adventure. Isniyés to every living being, I am so happy to be home "},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Wonderful Experience!", "review_description": "We had a great time visiting the Malign Lame and the Spirit Island on the cruise. Our captain Jacob and tour guide Sydney were fantastic. Sydney kept the entire tour very enjoyable with great stories about the lake and the island. We really enjoyed the tour. Thank you Sydney and aja on for the wonderful experience!"},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Great Cruise", "review_description": "It was a great cruise and very beautiful.  Becca and Nat were a great crew and very knowledgeable.  I would highly recommend doing this cruise."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "A fabulous boat ride", "review_description": "Even better than all the pictures is being here - simply stunning scenery during the approx, 1.5 hr trip on the lake. Much appreciated all the stories and insights provided by the host to this stunning area of the park."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "The value for money on a boat to Elf Island is average.", "review_description": null},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Loved it.  Took lots of great photos.", "review_description": "Spirit Island has a spectacular view.  It was worth it to see it in person."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": "Don’t miss this opportunity to see Lake Maligne.", "review_description": "A relaxing morning cruise with an easy walk on Spirit Island. Alex and Bea were excellent  in the captain and guide roles and everyone enjoyed the banter."},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": null, "review_description": null},
{"attraction_name": "35. Maligne Lake Cruise", "review_title": null, "review_description": "How far in advance do I need to purchase tickets for a mid July 2021 visit?"},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Great fun and very interesting!", "review_description": "Better than staying there!  We had a great time with our guide and came away from it feeling an intimacy with the hotel and its impressive history we never would have felt had we simply stayed there."},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Great 1 hr tour", "review_description": "The tour guide was delightful. Kind, funny and knowledgeable. It was just long enough (with 2 kids) and wonderful to see what we were able to see in that time."},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Great ride!", "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Great visit", "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "To do absolutely!", "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "A very chic historical tour!", "review_description": "I had an absolute wonderful time in Québec city with Cicérone tours! I got to visit the famous Château Frontenac and our guide Frédéric was knowledgeable, kind, and funny! We saw different parts of the château and hidden rooms only accessible upon reservations. We learned about the different eras of construction and about the famous people that visited the hôtel. It was freezing on the day I went, but only a small part of the tour was outside, and Frédéric made sure we went inside quickly! "},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "The history of the Castle!", "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Chateau Frontenac tour!", "review_description": "Great tour! Entertaining and informative. Lots of interesting information about the site and hotel. There are a few steps for some parts of the tour but also elevators for others if needed."},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Amazing", "review_description": "Our guide made it fantastic! He was very knowledgeable and was engaged with the group the whole time. It's such a fascinating place and while we were discussing the Rose Room, our guide just got done talking about an event that happens where canoes race to get from the Chateau area to Levi's ( the other side of the St Lawrence River) and we got to observe it happening! Which was so cool to everyone in the room.  This Château was built in sections, and each section had its own unique style. My teen loved learning about the history of this place. "},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": "Very interesting", "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": null, "review_description": null},
{"attraction_name": "43. Guided Tour of the Fairmont Le Chateau Frontenac in Quebec City", "review_title": null, "review_description": "I booked a reservation and the $1 fee was charged but I did not get an email confirmation. Who should I contact?"},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "A nice ride if you want to sit for a bit", "review_description": "Relaxing ride down the St. Lawrence. Variety of places to sot inside as well as outside. Nice views of the city and up to Mortmarcy Falls."},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "If you're doing one thing in Quebec City....", "review_description": "Absolutely loved this tour! The vessel was great, the staff was awesome and the guide was top notch. He went back and forth in French and English...amazing. The views of this city are astounding from the water. The food on board was really good as well. This is a relaxing and stellar way to see this incredible city. Again, if you have time for just one thing to do.... do this!"},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Montmorency Falls", "review_description": "This was supposed to be a beautiful way to see the Montmorency Falls.  It doesn't tell you that you don't get anywhere near the falls, that you get a quick look at them as you go under a bridge.  we were so disappointed; it was not at all what we expected."},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Amazing", "review_description": "The experience is great, you can buy food and drinks and the narrator is great makes the experience more enjoyable! Totally worthy"},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Perfect introduction to Quebec City.", "review_description": "Great introduction to Quebec City. The Guide the knowledgeable, entertaining, and very easy to understand. Loved seeing the Falls and being able to put the layout of the city in perspective."},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Golden service!", "review_description": null},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Seeing city and fall colors.", "review_description": "Nice river ride with excellent views of the city and water fall.  Narrator spoke in both French and English and was easy to hear and understand.  Very friendly and knowledgeable."},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Informative. Hot chocolate was cold.", "review_description": "The guide was really knowledgeable and had great energy. It was super windy at times but one could be inside or outside. There was enough seating inside and out all together, but not for everyone just inside or just outside. That meant when everyone wanted to come inside because it was too windy, we had to stand because no seats were left. But it was still very pleasant. "},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Awesome Tour!", "review_description": "The Louis Jolliet was very comfortable and the staff were quite attentive. The tour guide was absolutely exquisite in his delivery of information with expert timing and in very fluent French and English! Well done cruise people!"},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": "Never use Tripadvisor or other travel intermediary", "review_description": "We were delayed getting to Quebec City Guided Sightseeing Cruise. The cost was NOT refunded by TripAdvisor, nor would they rebook us another day.  The ship holds 1,000 and not nearly full."},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": null, "review_description": null},
{"attraction_name": "45. Quebec City Guided Sightseeing Cruise", "review_title": null, "review_description": "Dose this trip have alcohol ?"},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Fantastic overview and excellent viewpoints around the old town.", "review_description": "Great experience! The right balance of historical facts with fun facts like movies filmed in the area. Sam made the most of the dreary cold day with his wit and he read the group’s spirit accurately moving us away from the wind and to better photographic locations when able to do so. Very nice overview of old Quebec. Pace of walking and information is just right. Sam has plenty of expertise for anyone who needs more information. We highly recommend this tour. Thanks Sam! Your friends from FL."},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Excellent walking tour of Old Quebec", "review_description": "Fantastic guide, engaging and  offered a good balance between historical facts and local information. Despite it being bitterly cold the 2 hours flew by. "},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Great Walking Tour of Quebec City.", "review_description": "My wife and I enjoyed the tour with Sam. He was very knowledgeable and had great photos to add to his explanation of the historical information he shared with us."},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Fantastic Walking Tour – A Must-Do in Québec City!", "review_description": "I had such a great time on this walking tour with Sam! He’s incredibly funny, engaging, and full of fascinating stories — the two hours flew by. It’s a perfect way to explore the city! He promises you'll laugh at least three times, and boy, did he deliver!"},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Do this  walking tour first!", "review_description": "Do Samuel’s  tour first!  Sam is a walking encyclopedia of “fun facts”, interspersed with solid historical information.  Following the walk with Sam we have a full picture of Quebec City as he describes the greatest features, but also the hidden gems.  Sam quickly learned something about each of his guests, led a nicely paced walk, and offered advice of local spots to savour during  our stay in Quebec City."},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Amazing Tour of Old Quebec City", "review_description": "This tour is an excellent way to start your stay in Old Quebec City!  With a fun, friendly manner, Sam shows the highlights of Old Quebec City and shares the historical significance regarding different areas.  He also provides several suggestions about other places to see or where to eat.  There is a lot of fun facts about the Old City and I’m looking forward to watching Alfred Hitchcock’s, “I Confess”!  Also, the dad jokes aren’t too bad either;)"},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Very interesting and entertaining tour", "review_description": "This was a great free walking tour of Old Quebec. A first visit for us so very interesting. "},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Sam really knows how to do his job", "review_description": "Sam really knows how to do his job. Spending a few hours walking around Quebec City with him wasn’t just about learning the history; it was also full of fun, laughter, and entertainment."},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": "Amazing tour experience 10/10", "review_description": "I know there are many recommendations for Sam’s tour, and I’ll add my voice to the mix! Sam provides the best introduction to the unique history, culture and vibes of beautiful Quebec City. "},
{"attraction_name": "44. Uncover Old Quebec: Fun Walking Tour of the City with Local Guide", "review_title": null, "review_description": null},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Excellent day tour", "review_description": "Kim is friendly, helpful and take care for us during the day tour."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "A sensory delight!", "review_description": "Despite the rainy day it was an amazing experience! And they provide umbrellas too. It was a beautiful way to spend our last few hours in Victoria and highly recommended! The attention to detail, and the perfectly manicured layout is wonderful."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Top Tour", "review_description": null},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "A must while visiting Victoria and Vancouver Island", "review_description": "Great Botanical Garden. In the heart of Vancouver Island, that superb garden is a must! So beautiful and we are more city folks than nature lovers."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "A must see!", "review_description": "We booked this tour thru Royal Caribbean Shore Excursions and it did not disappoint! We got on a tour bus with about 24 people and the bus driver was very good at telling us the history of Victoria and pointed out different land marks on our way towards The Buchart Gardens. I think it took about 30 minutes to get there. The tour included entrance into the gardens and we did not have to wait in line at all. The gardens are truly breathtaking and we went thru most of it walking very leisurely. There is a little shop to get coffee, hot chocolate and pastries, etc. The gift shop is fairly reasonable in their prices. We truly enjoyed our visit to the gardens. Once back on the bus, we heard some more history about the gardens and saw a little bit of downtown Victoria. We had the option of getting off of the bus in downtown and walking back to the cruise ship but we opted to get back to the ship. Highly recommend this tour!"},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Beautiful Vancouver", "review_description": "Meghan was such a great guide. I would recommend her 100 percent! She is a native and really knows her stuff. She maneuvered us all around Vancouver and even took us to the airport at 3 am."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Great tour, great guide", "review_description": "Our guide and driver, Reneʻ, was fun, informative, enthusiastic, and shared his love of Vancouver, Victoria, and the Garden with verve and eloquence."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Unforgettable Journey", "review_description": null},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Outstanding tour", "review_description": null},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": "Great in every way!", "review_description": "Tours can be iffy, but this one was great.  Our tour guide, Rene, was an outstanding guide, offering a wealth of insight and history about Victoria and the Gardens.  In addition, the other guests on our tour were all very lovely, making the trip altogether memorable."},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": null, "review_description": null},
{"attraction_name": "46. Butchart Gardens and Victoria Sightseeing Tour from Vancouver", "review_title": null, "review_description": "Hello! This tour looks amazing tour, but we’re concerned about arriving to Butchart Gardens late in the day. Can you give us an idea of when this tour typically reaches the gardens?"},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Worth Every Penny - Excellent Tour", "review_description": "Informative and entertaining tour by guide Mark House. He really knows the history of the area and had many interesting stories. We saw so much without feeling rushed!"},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "A great way to see the best of St. John's", "review_description": "Mark House was our guide and he gave a wonderful tour. We learned a lot about the history of St. John's, and Mark had fun stories about Newfoundland slang and culture.  He kindly offered to take photos of us throughout the trip. The bus was comfortable, we had lots of time at each stop, and the tour was the perfect length. We saw all the big sights but never felt rushed. Highly recommend!"},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "A wonderful way to learn about Newfoundland! ", "review_description": "This was our first time in Newfoundland, and we found this tour to be fun, informative, and entertaining. Cliff knows his stuff! It is a well paced tour and we learned a lot."},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Very enjoyable- thanks", "review_description": "The trip was organised at short notice after being let down at short notice by a different company.  The comms from the company and the hotel (who didn’t need to help) and with me were fantastic.  The trip was well organised, informative, amusing and transformed what would have been a disappointing day.  Thanks to Ellis, our driver and guide- even though I didn’t win any candy"},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Fantastic day with Larry from McCarthy’s", "review_description": "We are visiting Newfoundland (from Ontario) for the first time. We had an opportunity to spend the better part of a day exploring St Iohn’s, Quidi Vidi, Cape Spear, and more with Larry as our tour guide. "},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Perfect Day !", "review_description": "Perfect day with friends.  Booked this tour with McCarthys and it was great.  Larry was extremely knowledgeable and was so accommodating.  Views, sights, and drive were all amazing."},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Getting to know St. John's, Newfoundland", "review_description": "I highly recommend McCarthy's Party Tours for the St. John's & Cape Spear experience. Our host, Larry, was informative, funny, kind-hearted, and awesome at story-telling. At the end of the tour, I suggested he start his own podcast so all the world could learn about what a fascinating place St. John's Newfoundland really is."},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "NO SHOW and NO CONTACT for our confirmed tour.Very disappointed", "review_description": "VERY DISAPPOINTED. "},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": "Amazing guide", "review_description": "Larry was an amazing guide and knew everything about Newfoundland. He has great suggestions for local restaurants and bars to visit. This tour has given me memories I definitely won’t forget!"},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": null, "review_description": null},
{"attraction_name": "47. Historic St. John's Newfoundland and Cape Spear Tour", "review_title": null, "review_description": "Do you pick up at the cruise port?"},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Amazing!", "review_description": "Great tour! Our first visit to Niagara Falls. Worth the trip. Micko, our tour guide, was very knowledgeable and took good care of us."},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "A day trip to Niagra", "review_description": "Our Guide / Driver Micko was very knowledgeable and helpful and provided great commentary during the trip. The Bus was in good condition and clean. "},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Great day trip from Toronto", "review_description": "A great way to see Niagara Falls on a day trip from Toronto. Our guide, Micko, was very informative, helpful and fun. Would recommend rather than going to stay at the falls. A must-do is to go up the Skylon Tower - tickets are cheaper if you buy them from your guide so take cash."},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Great day trip from Toronto", "review_description": "Lovely day trip from Toronto. Pick up and drop off were in a central/walkable location. Our tour guide, Mel, was so kind, patient, and knowledgeable."},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Great trip", "review_description": "This was an excellent experience visiting Niagara Falls all day.tour from Toronto.  We met some wonderful people in our group as well as shared some beautiful memories. "},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Will recommend", "review_description": "We were visiting Toronto and we planned on visiting Niagara Falls. We were going to rent a car to do this but I saw this and we decided to do this instead. We are so glad to find this tour bus. These are the few things I appreciated:"},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Best tour guide ever", "review_description": "Went on the Niagara Falls tour in April with Mel as my tour guide. I am not one to exaggerate but to say that he was the best tour guide I had ever had is no understatement. Knowledgeable and responsible, I was frequently impressed by his ability to share knowledge and manage the group. If he was my tour guide for other expeditions, I would gladly sign up. Kudos Mel!"},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Tick off bucket list", "review_description": "Ticked off my bucket list. Haroon was an excellent tour guide. Went under the falls because the boat wasn't operating. Also went up the sky tower. Photos taken as memories of this trip"},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": "Niagara Falls 2025", "review_description": "10/10 Haroon your guide. happy and cheerful. Went under the falls due to boat not going out. Also went up skytower. Took lots of photos "},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": null, "review_description": null},
{"attraction_name": "49. Niagara Falls Day Tour from Toronto", "review_title": null, "review_description": "Does this tour leave enough time to do hornblower boat and journey behind the falls?"},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Highly recommend the Old Quebec City Food Tour!", "review_description": "Our guide, Karim was knowledgeable and welcoming and gave us a great tour without overloading us with information. The tour was well paced and the food was delicious. It was great to be able to try a variety of dishes and learn about the local cuisine."},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Perfect Tour!", "review_description": "Really excellent tour. Maude, our host, was absolutely amazing! Wonderful stops and information. Maude made it really fun! Would highly recommend! Not to be missed in Quebec City!"},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Great food, drink and culture tour!", "review_description": "The tour was both informative about the Québécois history and culture as well as insightful about some of the traditional foods and more modern drinks that are consumed. Our guide Maude was wonderful and very helpful with recommendations after the tour. We made reservations at two of the places we ate at on the tour because we enjoyed the food so much. Highly recommend!"},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Great fun", "review_description": "A great experience - our guide Pamela was excellent working history into the tour. It’s a great way to learn about the culture of quebecois!"},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "An enjoyable experience!", "review_description": "This was one of the better food tours that we have been to. The food selections were delicious and worth the money that we paid for the tour. Maude was very knowledgeable on the history of Old Quebec City and her love of the cuisine was very apparent! She offered wonderful suggestions… it was an enjoyable experience!"},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Lovely!", "review_description": "A wonderful tour with lots of interesting history and fun eats! Even in the rain it was a good time. Phil was very knowledgeable and accommodating."},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Take the damn tour!", "review_description": "Our guide Phil made the experience even better.  He was knowledgeable and engaging.  Highly recommended to first time and returning visitors."},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Excellent tour", "review_description": "Guide Maude was knowledgable and entertaining.  "},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": "Poutine, Bison and Gin tasting was Excellent!", "review_description": "Overall, the tour presented a good selection of items that I had not tried and introduced new locations to visit later which were not on my initial itinerary."},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": null, "review_description": null},
{"attraction_name": "50. Old Quebec City Food and Drink Walking Tour", "review_title": null, "review_description": "We'll be on the Celebrity Summit cruise ship.  Was wondering how far it is from the port to the starting point?\nMerci."},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "This Place is Incredible! A bucket-list item, for sure!", "review_description": "Started out by meeting our tour guide, Gordon, who is just about the nicest person you'll ever meet.  He made the road trip from Calgary into Banff quite enjoyable with lots of stories and jokes.  He had answers to pretty much every question that I asked."},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Fantastic way to see the Banff area!", "review_description": "What a fantastic day trip!! Murray added so many fun tidbits of info, loved his commentary throughout the day! The Banff area is absolutely breathtaking and this was such an easy, stress free way of seeing all the top sights! I highly recommend this tour!"},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Unreliable, do make sure if you book, you have alternative plans", "review_description": "The tour was cancelled at the very last minute on the morning of the tour and the tour guide claimed that the tour was cancelled due to “snow and clouds” and that everyone else on the tour “agreed” to go the next day. When I tried to explore if there was any alternative tours, I was also told that there was “nothing out to Banff” that day. "},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Banff winter beauty", "review_description": "It was a wonderful day trip to Canmore, Banff, and Lake Louise! Murray was our guide and was informative and funny! Our slight hiccup was that a new addition had been added last minute and we had to turn around to get them but otherwise really great!"},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Incredible Views", "review_description": "The pictures on the site are real ! Breath taking views throughout the day. Murray our tour guide was a delight, tailoring the commentary to the group. We all became fast friends and enjoyed our day together.  Experiencing every Canadian season in the 11 hours on this April day.  😄"},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Just read the summary lol", "review_description": "Murray was very nice and informative. Had enough time to explore and look at every stop. Had a great time. Would recommend for summer, but winter was nice to look at too."},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Awesome", "review_description": "Amazing tour, Kevin & his crew are professional, engaging and super friendly. This whole experience was a blast and we enjoyed every second of it!"},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Great Trip", "review_description": "We thoroughly enjoyed our trip with Murray as our guide. Prior to the trip we were informed on what to wear what to bring where to meet and what time. An itinerary was also given to us to know what to expect. Murray was very informative and entertaining, and it was nice to sit back and relax and enjoy the scenery. We would highly recommend this trip to anyone wanting to visit the Banff National Park."},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": "Amazing day out !", "review_description": "The views were incredible . Our guide , Gordon , was brilliant , very patient informative and funny . He also helped us take family pictures . This trip is a great way to see the area and to stop off at lots of beautiful places we probably couldn’t have reached otherwise . Lake Minnewanka  and Lake Louise are both stunning . There was also a pit stop at Canmore and a longer stop on Banff . I would most definitely recommend this trip  if you are looking to spend time around Banff National Park ."},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": null, "review_description": null},
{"attraction_name": "48. Discover Banff National Park - Premium Day Trip", "review_title": null, "review_description": "Can we be pick up at the Fairmont banff and drop off in Calgary please?  With 2 medium size bags April 19 Saturday tour"},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "Great day in Toronto", "review_description": "Great day in a small group of four. Guide Heather was great, polite and well informed. Organisation was top and we were lucky with the weather. Started with a tour through the city of Toronto, followed by CN Tower, St. Lawrence Market and a Harbour cruise. I had a wonderful and experienced day."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "A not to be missed tour!", "review_description": "We had a wonderful time with Daniel our guide. He was very knowledgeable, funny & easy to get along with. He showed us great sights, gave excellent suggestions for our visit and  ensured we had a memorable tour. We thoroughly enjoyed Casa Lomas & had plenty of time to see it all, we went up the CN tower & luckily the weather was great for seeing the city and beyond. Daniel took us to St Lawrence market & suggested we try the renowned Peameal bap, which didn't disappoint! What an all round lovely guy & definitely well worth the price. "},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "Mom & Son Trip", "review_description": "Leila was an absolute pleasure to tour with today! My son and I met two east coast families for the day and thoroughly enjoyed ourselves. Great pace overall with our favorite stop being St. Lawrence Market. Will definitely return with more family."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "A must do tour, fantastic experience", "review_description": "I had an absolutely amazing time on this tour, it was the very last thing I did on my Toronto trip and it was such a perfect end. Daniel was incredibly knowledgeable about not only the Toronto area but also the the main sights listed on the tour. "},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "A really nice sightseeing!", "review_description": null},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "Good stuff", "review_description": "Overall, the tour was convenient. Cheryl the tour guide was incredible. There are good guides and then there’s Cheryl. We have learned a lot about Toronto and the Canadian culture. A very pleasant experience."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "Great guide! Great program!", "review_description": "Great guide, good mixture of sight seeing activities. Daniel told a lot of stories about Toronto about the history of T."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "A decision well made!!", "review_description": "The trip was a personalized tour of Toronto. After two major snowstorms, my mate and I would not have been able to see as much of Toronto if we had to navigate on our own. Daniel, our guide and escort was knowledgeable and very friendly. He went above and beyond to make us feel welcome!"},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "Discovering the Essentials of Toronto", "review_description": "The tour provides a quick and practical way to see some of Toronto’s most iconic landmarks, such as the CN Tower and the Distillery District. It also includes a very relaxing and interesting boat ride along the shores of Lake Ontario to admire the city skyline."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": "See lots of the city", "review_description": "Great guided tour that allows you to see more of the city than by walking. The stops were well planned out. The guide, Daniel, was very informative."},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": null, "review_description": null},
{"attraction_name": "51. Best of Toronto Small Group Tour with CN Tower and Harbour Cruise", "review_title": null, "review_description": "Hi. Can you pick up me for the tour from 5851 Victoria Ave, Niagara Falls, ON, L2G3L6 Canada with baggage? What will be cost of that? Drop off in Toronto "},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Be careful which package you choose!", "review_description": "Be very very careful what you book. There are different packages. We booked a tour to Quebec City with Montmorency water falls. Our package included a cruise of the falls.  But while at the Falls, we were told that cruises don't start until end of May. Packages say that some attraction entrance fees are included, well, there were no entrance fees. We freely walked into every location without the need of an armband, stamp or ticket. I found that a bit deceitful. "},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "very Nice experience", "review_description": "It was the best experience I had in Montreal "},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Great BUT not 100% great!", "review_description": "Okay - honest review - the pick up and drop off was smooth, and i was comfortable in the bus! We were the fist one in montmorency falls so we were able to get to the top of the bridge via cable car fairly fast! It was a great tour tbh the tour on quebec city was nice!! Bring Cash."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Amazing Day in Quebec", "review_description": "The trip to Quebec was wonderful. The city is gorgeous it is just like being in a European country. Our guide Nicole was great she was friendly and made the tour fun"},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Good trip", "review_description": "It was a very organized trip and time management was great."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Please take this tour", "review_description": "A charming European-style city with cobblestone streets and French influence. The tour provides excellent historical context, and the cruise ride was truly enjoyable."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Excellent tour to Quebec City", "review_description": "The trip was very well organized and efficient (including shuttle pickup and dropoff to my hotel). The guide William was very informative (speaking in four languages!). Each of the destination spots were great."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Fabulous", "review_description": "What a wonderful experience. We got to see the ice hotel instead of a cruise. It snowed all day plus the decorations made it totally magical."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": "Great Experience, would recommend", "review_description": "Very well organized. Everything was on time, seats were previously assigned. The guide (Yu) was very good. The driver was very courteous and friendly. The tour was excellent, we got a great overview of Quebec City."},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": null, "review_description": null},
{"attraction_name": "53. Full-Day Quebec City Tour plus Sightseeing Cruise", "review_title": null, "review_description": "Hi.   I thought I reserved for august 6 but I think it didn’t work and now it says 7th.  Is there any way I can get 3 for the 6th?"},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Traffic and itinerary issues affected me review", "review_description": "Our guide, Kaelen was very knowledgeable and personable but it was not my favorite tour due to major traffic delays in Granville.  We did a nice tour of Stanley Park and were just dropped off in Granville Island to find our way around.  No map so it was very difficult to navigate.  As we left Granville Island, there were numerous traffic detours that took up a lot of time.  We had a limited tour of the rest of the city so that the driver could take others to other stops.  I wouldn’t have booked this tour if I had known there were people on other tours on the same bus.  I had hoped to see the clock in Gastown but we didn’t have time to see it."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Super friendly fun tour", "review_description": "Very informative a great way to get to know the city. Tim our guide was very knowledgable and communicated it all in a friendly fun manner."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Stanley Park and Granville Island!!", "review_description": "We did this tour as a combination with the capilano bridge package and were astounded as east coast Americans by the beauty of Stanley park. Our state North Carolina has pretty trees and parks at the far end of the state but it's a few hours travel versus having it around you all the time. The greenery and serenity as well as the totem poles are well worth a trip. Granville Island was also a treat with the Net Loft and Granville Island Brewery which we plan to return to. The public market has so many small stalls of goods as well as a food court-esque area with several different cuisines. It made for a fun stop with an almost intimate or lesser known atmosphere. Also shout out to our guide Sarah for this tour as well for being a hoot and knowing a bunch of facts and trivia about our stops!"},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Great Tour", "review_description": "Brent was nice and very knowledgeable. The tour was very informative. We got to see the main tourist places. Money well spent."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Excellent and very thoughtful guide!", "review_description": "Sarah was fantastic!! She was engaging and entertaining. Her personal knowledge of so many areas really showed thru!! Definitely recommend."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Great day in rainy Vancouver", "review_description": "Great day spent with Tim who was friendly, knowledgeable and entertaining"},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Great sample of Vancouver", "review_description": "We had a very short amount of time in Vancouver and wanted to get a taste of the city. This tour was a great length, and took us through some beautiful parts of Vancouver. We especially appreciated our guide, Sarah’s, local insights. We would love to get back to Vancouver and recommend this tour for those with a little amount of time, and even those with more to plan what else you want to see."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Vancouver City Highlights + Lookout + Capilano Suspension Bridge Tour", "review_description": "Experience Vancouver in a day with this engaging small group tour. Our driver and tour guide, Kyle, was excellent—knowledgeable, funny, and passionate about BC (British Columbia). His storytelling and insights into Vancouver's history and culture really enhanced the experience. We even learned some fun facts about celebrities like Ryan Reynolds and Seth Rogen."},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": "Nice market", "review_description": "Brent was very informative and a very good driver. We enjoyed the tour and seeing the different sections of the city and stuff"},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": null, "review_description": null},
{"attraction_name": "54. Vancouver City Sightseeing Tour: Granville Island & Stanley Park", "review_title": null, "review_description": "I’m in Vancouver for on July 15. Is it possible to include me on your afternoon tour? "},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Enjoyable Day at Three Vineyards", "review_description": "Guy drove us to two vineyards.  Lunch break - dine where we choose - in Niagara-On-The-Lake, an adorable little town.  Then one more vineyard.  Great experience.  There were 11 people in our group.  Super fun informative day."},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "It’s as awe inspiring as you can imagine!", "review_description": "It’s just impressive to see nature at work.. I would literally pay to go again. Going behind the Falls was fun but there’s a line of people and you only get basically 20 seconds. You don’t just get to sit there and take it in. To do that you have to go out to the deck which is still super impressive again I’d pay."},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Wine Tour", "review_description": "The wine tour was great, learned a lot about the vineyards, and the tour of the wine making process was very enjoyable!"},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Beautiful Scenic Area. Surrounded by Fun People. Tasting a Variety of Wines. You Can't Ask for Much More!!!", "review_description": "Excellent guide...very friendly and very knowledgeable of the area in general and most of the wineries specifically. "},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Wonderful winery tour in Nagra on the Lake", "review_description": "Excellent tour….very relaxing drive.  The driver was exceptional and had in-depth knowledge/history of the winery’s and the area of Niagra on the lake…..I highly recommend this tour."},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Lovely experience with my parents", "review_description": "I took my parents on this tour while they were visiting me in Toronto. We took the VIA Rail Train down to Niagara to meet with tour and unfortunately the train was delayed due to track work. We ended up Ubering to the first winery to meet up with the group and continue on with the tour. I'd say that we enjoyed all the wineries, Pilliterri's was our favorite!! Super interesting tour. We were not super impress by Reif Estate - it seemed more like they were trying to get through our tour and push us out the door. Overall, a really great experience and I would recommend. One note, I wished the tour guide communicated with us a little bit better when we were running late so we knew where to meet us with the group and didn't feel like we were on a wild goose chase - but it all worked out!"},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Spend the day sampling wine while someone else drives!", "review_description": "Really enjoyed this wine tour. We spent time at 3 different wineries, bought wine at 2 of them. We didn’t need the shopping time but it was a nice break for food."},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Great experience!", "review_description": "Our tour guide Tim was phenomenal. So kind, so knowledgeable, so helpful. This was one of my favorite experiences visiting Canada. I would come back and do this tour again. Thank you for a great experience."},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": "Amazing afternoon of wine!", "review_description": "Another fantastic tour with the Winery Guys. We got to visit 3 great wineries and were well taken care of. Never felt rushed, lots of wines to try and learned a lot about each one. Our guide Tim was friendly and took good care of us. I highly recommend booking with this company!"},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": null, "review_description": null},
{"attraction_name": "55. Full-Day Niagara-On-The-Lake Guided Wine and Charcuterie Tour", "review_title": null, "review_description": "how many wineries do you vist and what are the names of the wineries?"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Niagara Trip not so Platinum", "review_description": "Nice trip. Definitely not a platinum experience. More"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Wayne is the best", "review_description": "Good value for the price, Wayne is amazing at his job and will make the long journey entertaining! Super knowledgeable!"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Best Tour Ever!", "review_description": "The Niagara Falls were absolutely stunning. I am so grateful that we got to see them. In addition to the view, our tour guide Shaf was knowledgeable about the city and funny. The wine and food were delicious and we had lots of opportunities for souvenirs. Would 100% recommend this specific tour for anyone who wants to see the Niagara Falls. Thanks Shaf!!"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Amazing Views", "review_description": "The view was amazing especially during lunch. I took lots of photos and video. We did the behind the falls tour since it was still ice in the river but the view from there was great!!!"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Enjoying the Falls in the spring", "review_description": "The tour to Niagara Falls was a great experience.  Our tour operator Tracy did a great job.  Spring time is definitely a great time to go.  The weather was amazing."},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "More than expected", "review_description": "This trip was the highlight to our Toronto vacation. We were driven to the Niagara falls and the driver told us the history of each area as we passed through. I'm so happy we didn't have to drive there ourselves. I'm happy we got some good historical knowledge. There were a decent amount of stops so we had time to use the bathroom. The driver also drove well. Thank you to the trip advisor and the driver for waiting for us we couldn't get a good handle on the Toronto traffic with no service. "},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Niagara Falls Excursion", "review_description": "Overall it was a very good experience. My favorite part was having lunch at Table Rock House Restaurant, right above Niagara Falls. The food was good and the view was amazing. We were not able to take the boat because weather conditions didn’t permit it. Instead we did the tour behind the cataracts, which was very interesting. I really feel that I didn’t missed anything. We also had maple syrup tasting at the beginning and wine tasting at the end of the day. The only issue that we had is that when one of the passengers was dropped off, and her luggage was retrieved from the baggage compartment, the compartment door couldn’t close and we had to wait a moment for the situation to be solved. The driver lost her cool a bit but it wasn’t a big of a deal and at that point we were already back in Toronto. I would definitely like to do it again in the future but during spring time. This is my third tour using Trip Advisor and so far everything has worked out great."},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Good", "review_description": "Tour guid perfect "},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": "Best Tour Ever", "review_description": "Best tour I have ever taken. Jam-packed and very knowledgeable hosts. Book the tour immediately. You will not regret it!"},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": null, "review_description": null},
{"attraction_name": "52. Niagara Falls Day Tour Includes Boat Cruise, Winery Stop & Lunch", "review_title": null, "review_description": "If we are staying in Niagara Falls is there a way we could still take part on the tour and everything it offers excluding the transportation?"},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Phenomenal view at Peggy’s Cove", "review_description": "We had an amazing tour to Peggy’s Cove with our guide Nilah. Nilah is very knowledgeable about every part of the tour and answered all our questions She was also very courteous. Peggy’s Cove is an absolute treasure. The view is amazing."},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "To do absolutely", "review_description": null},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Driver didn’t show up", "review_description": "We waited half an hour, struggled to contact company and when we finally did they knew nothing.  Called us back and said driver cancelled last minute. Unsure if anyone was going to tell us. So annoying and disappointing"},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Beautiful and great tour guide", "review_description": "the guide/driver was excellent, he gave us lots of information about the place, he made it very intertaining, I would definetly recommend the trip, it is a beautiful place!"},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Worth the money.", "review_description": "A little late posting. We went in October 2023. We used SeeSight to get to Peggy's Cove. It was supposed to be a car with 6 people in it. We had each pre-booked seperately. The other 4 didn't show up so we had the car to ourselves. I don't remember our driver's name but he was great. Gave us a lot of information about the area on the drive out. We stayed there a couple of hours (which is plenty) and he picked us up at a certain spot. We had him drop us off at a restaurant a few blocks from the ship. Highly recommend."},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Peggy cove", "review_description": "Nilah was amazing, she taught me so much about Nova Scotia and Peggy’s cove. She made the ride a lot of fun! Highly recommend a tour with her!"},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Great short visit to Peggy’s cove", "review_description": "Nilah was a lovely guide. She provided the small group with an appropriate amount of background on Halifax sites as we drove thriftiness town and then as we drove out to Peggy’s cove. "},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Excellent tour thanks to Nilah", "review_description": "Our Driver Nilah (I hope I got that right) was excellent. Gave us a lot of information about Peggy’s Cove and surrounds. Had enough time to wander around PC and have a quick bite of lunch. Overall a really good tour."},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Halifax to Peggy’s Cove on Oct. 22, 2024", "review_description": "Cynthia was our tour guide from Halifax to Peggy’s Cove.  She was very knowledgeable about the area and very friendly.  Cynthia made our cruise day to Peggy’s Cove very enjoyable.  We would highly recommend her and Tripshepherd (tour operator)."},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": "Awesome Trip", "review_description": "Nilah was a great tour guide.  She grew up here and did a great job of telling us about the area on the way to Peggy’s Cove.   90 minutes was the perfect amount of time at Peggy’s Cove - a charming fishing village with nice local stores for plenty of shopping.  Crab roll was very good.  Great tour."},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": null, "review_description": null},
{"attraction_name": "56. Peggy's Cove Express Small Group from Halifax", "review_title": null, "review_description": "How do I find out if my tour was booked?  I don’t have a confirmation "},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Amazing experience", "review_description": "Amazing day with Ben our tour guide! Went above and beyond to make this a special day! We not only got to explore some beautiful sites but learnt so much extra information about everywhere that we wouldn’t have if we did it ourselves! The trip was time efficient and we had plenty of time in each place!"},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Niagara Falls", "review_description": "Great trip, thanks Alex and Hogo. Well paced and an enjoyable day. My only issue is that TripAdvisor advertised this as including the boat trip, but the boat wasn't running."},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Grateful for my time in Jasper", "review_description": "I had a wonderful day with Jamie as my guide. I learned so much about the area, got the chance to see some wildlife and amazing views, and enjoyed the pace of the trip. Specifically, I enjoyed getting off the bus for a short hike at the canyon and the boat ride on Maligne Lake among other stops. Thank you for a great day! My thoughts are still with everyone in Jasper as I am deeply saddened to hear about the devastation with the wildfires. The park is truly a gem."},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Wonderful full day tour", "review_description": "This was an amazing tour. Our tour director and driver was Sam. He offered lots of information and history about the area . We had lots of time at the stops and just an overall wonderful day. So happy to have done this tour!"},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Banff Day Tour Experience", "review_description": "Ben was an amazing tour guide! He took great photos for my family and provided a lot of background information about Banff! Highly recommend to join the tours by Banff To Do!"},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Adventure to Banff", "review_description": "Amazing Tour, as expected rain, snow , cold  weather, its worth the adventure, great experience  specially for us  and  will visit again maybe not in winter but summer (some lakes are still frozen or not safe to travel.  Highly recommend to anyone this tour company worth what you paid for, Who will visit calgary Banff  they have outstanding service ontime and accomodating. Thank you for the experience"},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "brilliant tour.", "review_description": "what an amazing tour... The views were spectacular. "},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Beautiful experience", "review_description": "Beautiful scenery & experience. Mike was a wonderful guide & extremely knowledgeable. Would recommend definitely. Even in winter with everything frozen the lakes & marble canyon were amazing. Only disappointment was Lake Louise village, which is just a pit stop."},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "A whole day trip", "review_description": "One of the best tours we ever had. We started a sunrise finished at sunset. Great value and our guide was very nice and knowledgeable"},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Great scenery & itinerary. Storm was an all star tour guide!", "review_description": "Storm was a great tour guide! He provided lots of interesting facts, funny stories, and was extremely patient with the group. People, please be mindful of the time as to not hold the whole group up! This tour gives a good amount of time at each location. Perfect balance between seeing multiple, breathtaking locations and having enough time at each to enjoy. I have been on similar tours that only allow enough time to snap a picture, then leave. "},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": "Calgary, and Banff and so much more!", "review_description": "Ben did absolutely amazing! I would take another trip here to see him. He was full of information and he did an amazing job!"},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": null, "review_description": null},
{"attraction_name": "57. Lake Louise, Moraine, Emerald Lake, Yoho, Marble Canyon &Banff", "review_title": null, "review_description": "Does it or does not it not include lake louise? The description mentions lake louise for both included and excluded."},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Brilliant go for the lunch option foods ok but views are amazing from restaurant we did the tunnel boats not running 5 *", "review_description": "Brilliant go for lunch option foods ok vows amazing coach comfy guide good lots of stops did tunnel as boats not running but was really good"},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Great experience!", "review_description": "Had a great tour! The hotel concierge recommended Grayline and I spent hours looking at options and then ultimately settled back with them. I wanted to see Niagara on the Lake and I’m glad we did! It’s very cute and I would have liked more time there. "},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Niagara a must.", "review_description": "First time using Viator for anything and they did not disappoint us. 9hr day trip to Niagara stopping on way for maple syrup tasting then onto the Falls. Breathtaking.  Our driver/ guide Sholz was superb giving details of the trip. His driving was excellent and we never felt worried although traffic was heavy at times."},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Best solo full day tour Niagra Falls", "review_description": "Peter was the best tour guide! I had the absolute best time by myself but met amazing friends from around the world. Comfy new bus & great driver. Boat ride at the falls then buffet lunch with amazing views then a stop in the cutest town called Niagra on the lake! Then delicious wine tasting at hare wines! Highly recommended by my travel agency!"},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Day of fun!!!", "review_description": "Total recommend, had a lot of fun , operator explained the sites and history as you ride , made sure everyone was in attendance after each stop so no one was left behind , the wine tasting was great ending of the tour .."},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Excellent trip to Niagara Falls and Beyone.", "review_description": "Wonderful tour guide (Alex) and great driver (Hugo). Very entertaining and informative. Well organized, right amount of free time, several activites and experiences including the fabulous Niagara Falls boat trip, the whirlpool, a stroll through Niagara-on-the-lake with time to shop, and a trip to a vineyard and tasting. Great day. Well worth the money!"},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Niagra Falls", "review_description": "Finally decided to go to Niagra falls. Reached by 11.45 am from where busses took us to table rock area whee the fall was outstanding & there I made up my mind to stay a night, therefore went to Sheraton as it was the best as near to all attractions.  After checking inn went outside for the boat ride which takes us near the fall. The experience was outstanding. After the boat ride came to hotel, got the room & went to sleep but in evening I changed the room as there was elevator sound like plane engine. Got a better & bigger room. Walked in night too as the area is big so had to cover. Slept at 12 am midnight."},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": "Highly recommend, fantastic day out.", "review_description": "Coach was comfortable and cool with just the right amount of chatter from Daniel our guide, so we could watch the views. Great driving by Peter too. Niagara was breathtaking, boat ride amazing, lunch at the Sheraton was good, with great views of Niagara. Lake Niagara was cute, definitely visit the Xmas shop. The wine tasting was good. "},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": null, "review_description": null},
{"attraction_name": "58. Day-Trip from Toronto to Niagara Falls with skip-the-line boat", "review_title": null, "review_description": "Do you pick up from hotels in downtown Toronto?"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Extreme Discomfort on Sweltering Van", "review_description": "Do not recommend this tour as the company cares nothing about your comfort as they claim on their advertisement.  They operated on an extremely hot day that was close to 100 degrees F with a broken air conditioner.  When returning to the van after hikes, etc., the van was scorching hot and everyone needed to wait for it to \"cool\" somewhat.  This was totally unacceptable.  Unless they start to maintain their equipment as they should, recommend to stay far away!  Tour guide was very knowledgeable but spoke the entire time which became annoying after a number of hours and added additional stress to an already highly uncomfortable situation."},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Thanks Pascal!!  Great tour guide", "review_description": "Our tour guide Pascal was awesome!  Lots of local insight and tips, stories, history, etc.  The cruise to Spirit Island was a favorite part of the trip.  Got to see a HUGE elk, baby bald eagles on nest, deer, etc.  Wish we could have seen bear and moose, but they were elusive.  :(   Rest of trip was terrific!"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Wonderful tour", "review_description": "Very cool experience!  Saw elk, bald eagles, 2 moose and 2 bald eagles with their babies in the nest.  The boat trip was fabulous as well, Maligne Lake is so beautiful.  Our boat trip guides, Dan & Alex, were so interesting & helpful."},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Excellent service and memorable trip", "review_description": "This tour was very interesting, especially for a family. Our tour guide, Kelly, told us meaningful information, like the stories of the land. We learned lots about bears from her and how to defend ourselves if we are near one which was very fun to hear about. Kelly was also very accommodating by offering us cold water bottles. She showed us different types of antlers as well. During the bus rides, we were allowed to quickly stop and take photos of wildlife. The trip was memorable ( written by Teenager)"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Best place on earth", "review_description": "Best part of our trip through the Rockies, not to be missed. The views and tour were unbelievable, Bree and Sam on our tour are the best on this type of trip that I have seen"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Excellent trip!", "review_description": "Jake, our guide, was very passionate about the area and wildlife which led to a very informative and enjoyable tour. He was able to deliver the information in a way that was easily understandable although we’re not so sure about his jokes!  It was a little too hot to see much wildlife but, with Jake’s recommendations, we returned late evening and saw everything apart from bear!"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Outstanding Outing", "review_description": "Our guide, Alan, was awesome. Knowledgeable, friendly, and thoughtful. We saw lots of wildlife: elk, moose, marmot, eagles, osprey.  The hike in Maligne Canyon was wonderful, and the boat ride on Maligne Lake was perhaps our favorite outing in all of Banff and Jasper."},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": "Amazing Experience", "review_description": "Jake our vus driver was AWESOME! He was funny, showed us some amazing stuff and was super informative. Becca and Sam were also amazing on the boat tour! 💯 worth every penny! Thank you!"},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": null, "review_description": null},
{"attraction_name": "59. 5.5-Hour Jasper Wildlife and Waterfalls Tour with Maligne Lake Cruise from Jasper", "review_title": null, "review_description": "Are there rest stops on this tour to use the toilet?"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Amazing Tour", "review_description": "The tour was just amazing! The small group made the experience so much more personal and enjoyable. The tour was very well organized with enough time for lunch break and very flexible to everyone’s needs. Our tour guide, Naveen, was fantastic — very patient, kind, relaxed and also a great photographer! I never felt rushed and had plenty of time to truly enjoy every moment. Thanks to Naveen’s local knowledge, we were able to avoid big crowds, discover hidden spots, and learn lots of interesting facts along the way. I would definitely book this tour again and highly recommend it to everyone!! Thank you Naveen for the truly amazing day!"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Banff, Lake Louise Full Day tour", "review_description": "Naveed was a wonderful tour guide and an excellent photographer.  There were so many beautiful and memorable stops.  A perfect day!"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Solo traveler in Apr-25. Beautiful views! Great tour! ", "review_description": "It was a tailored tour. We just needed to ask and it was part of the tour. Saw so many beautiful things with friendly people. Thank you  "},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Absolutely the best!", "review_description": "Our tour guide Rahul was absolutely amazing!  He had so much information on the areas we visited, so we learned a lot and saw so many beautiful sights.  The experience of walking on the ice to the waterfalls was incredible and unexpected.  Can’t say enough about this tour and our wonderful guide."},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Fantastic views, sunshine, good company and no doubt, the best guide !", "review_description": "We had an amazing day !  Rahul has been wonderful from the time of pick up to the end of the day !  Funny and always looking out for us."},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Great Experience", "review_description": "The trip was very well organized - Rahul is very passionate about his work, and he knows the area very well. He is flexible, lets the group enjoy and is a very friendly guy. He is always willing to take the extra step to make the group comfortable  - we would highly recommend and if ever come back to Banff we will defiantly be using this company"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Naveen picked us up at the train station, and we set out on an amazing day!", "review_description": "The day was perfect! We saw a lot, Naveen was kind and patient. We saw so many beautiful places. We highly recommend it!! Thank you for a great day!!"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "10/10 experience", "review_description": "Naveen was an amazing guide! We had such a fun day and saw so many different places, but never felt rushed and we were encouraged to explore. He took a ton of great pics that we will cherish forever! Can’t wait to come back in the summer and explore again!"},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": "Fantastic day trip!", "review_description": "We had Rahuh as our guide. From the moment he picked us up at our hotel to the time he dropped us off, he gave us 150% of effort and very attentive to  ensure that we had a fantastic time. He took us to so many great locations and adjusted the tour since we’ve gone to a few locations in previous days. "},
{"attraction_name": "60. Small Group Day Tour to Banff Lake Louise Moraine Lake Icefields", "review_title": null, "review_description": null}
]